{
  "contract_id": "2203-24",
  "company_name": "NOXIOUS LIMITED",
  "filename": "NOXIOUS_LIMITED_contract",
  "markdown": "```markdown\n# PAYMENT MANAGEMENT SERVICES AGREEMENT No. 2203-24\n\n**Main Contract Date:** 22.03.2024\n\n---\n\nThis document combines the main contract and all additional agreements for NOXIOUS LIMITED (trading as SkinsMagnate).\n\n---\n\n# ADDITIONAL AGREEMENT No. 1\n## to the PAYMENT MANAGEMENT SERVICES AGREEMENT No. 2203-24\n\nThis ADDITIONAL AGREEMENT No. 1 (the \"Additional Agreement\") is concluded in 31st July 2024 to the PAYMENT MANAGEMENT SERVICES AGREEMENT No. 2203-24 dd 22.03.2024 (the \"Agreement\") by and between:\n\n**NOXIOUS LIMITED**, a legal entity duly established and acting under the laws of the United Kingdom, with the registered number 14657425, registered office is at: 85 Great Portland Street, First Floor, London, England, W1W 7LT, represented by the Director Anastasiia Chervona (hereinafter referred to as \"Merchant\"), and\n\n**SMARTFLOW PAYMENTS LIMITED**, a legal entity duly established and acting under the laws of the United Kingdom with the registered number 11070048, whose registered office is at: Office 39.18, Level39, One Canada Square, London, E14 5AB, represented by the Director Anastasiia Pervushyna, (hereinafter referred to as the \"Company or SPL\")\n\nMerchant and Company are hereinafter sometimes referred to individually as \"Party\" and together collectively as \"Parties\".\n\n---\n\n## 1. Subject of the Additional Agreement:\n\n1.1 Parties decided to change EXHIBIT A to the following:\n\n---\n\n### \"EXHIBIT A – COMPANY FEE. COMPANY PAYMENT OPTIONS\n\n#### COMPANY FEE\n\nThe Company Fee shall be calculated at the rates specified below with regard to each payment method and shall be withheld by the Company from the Transaction Amounts.\n\n#### CURRENCY\n\nAll payments to the Merchant under this Agreement shall be made in EURO (the \"Currency of the Agreement\"). In the event that Company receives the Transaction amounts in the currencies other than the Currency of the Agreement, the Company shall, at Company's cost, convert the said amounts into the Currency of the Agreement based upon the selling exchange rate published by the Bank of England on their website https://www.bankofengland.co.uk as of the day when the settlement is due to be made by the Company to the Merchant current account.\n\nThe Merchant, its subsidiaries and affiliates own and/or operate the websites https://skinsmagnate.com/ through which consumers may purchase and utilize various interactive content, virtual goods and/or services in Euro and/or GBP.\n\nMCC code is 5816.\n\n#### PAYMENT METHODS\n\nThe Company shall have the right to make the following payment methods available to the Merchant through the Company Platform for the fees described below applicable to the electronically disbursement to a bank account in EUR:\n\n| No. | Online services | Company Fee, % |\n|-----|-----------------|----------------|\n| 1. | Internet acquiring, EUR | **3.8 %** |\n| | Apple Pay and Google Pay | **5.0 %** |\n| 2. | Chargeback | **50 EUR** |\n| | Refund | **5 EUR** |\n| | RR | **10% /180 days, max 250,000 EUR** |\n\nThe Parties agreed that all bank charges and commissions accrued by the Company's bank and the Merchant's bank will be paid by the Company.\"\n\n---\n\n## 1.2. Parties decided to change EXHIBIT B to the following:\n\n### EXHIBIT B – DETAILS OF THE PARTIES\n\n#### MERCHANT:\n\n| Field | Value |\n|-------|-------|\n| Company Name | NOXIOUS LIMITED |\n| Address | 85 Great Portland Street, First Floor, London, England, WIW 7LT |\n\n#### Bank details:\n\n| Field | Value |\n|-------|-------|\n| Virtual Account Name | NOXIOUS LIMITED |\n| SWIFT/BIC | PYYPGB21 |\n| Virtual IBAN | GB17PYYP00993910001108 |\n| Payments Institution Name | My EU Pay Ltd. |\n| Payments Institution Address | 24 King William Street, London, EC4R 9AT |\n| Payments Institution Country | United Kingdom |\n\n#### Contact details (as such may change from time to time as notified by each Party to the other Party in writing):\n\n| Field | Value |\n|-------|-------|\n| Name | Anastasiia Chervona |\n| Email | ceo@skinsmagnate.com |\n\n---\n\n#### COMPANY:\n\n| Field | Value |\n|-------|-------|\n| Company Name | SMARTFLOW PAYMENTS LIMITED |\n| Address | Office 39.18 Level39 One Canada Square, London, England, E14 5AB |\n\n#### Bank details:\n\n| Field | Value |\n|-------|-------|\n| IBAN | LT463880010100316908 |\n| Account Number | 10100316908 |\n| Account Holder Name | SMARTFLOW PAYMENTS LIMITED |\n| Bank Name | Payswix, UAB |\n| Bank Address | Lvovo g. 25-104, LT-09320 Vilnius, Lithuania |\n| BIC | GLUALT22XXX |\n\n#### Contact details (as such may change from time to time as notified by each Party to the other Party in writing):\n\n| Field | Value |\n|-------|-------|\n| Name | Anastasiia Pervushyna |\n| Email | apa@sends.co |\n\n---\n\n## 2. Effective Date and Remaining Provisions\n\n2. This Additional Agreement will come into force 15th July 2024.\n\n3. All provisions of the Agreement not affected by this Additional Agreement shall remain in force.\n\n4. This Additional Agreement is executed in two copies, in English versions, one copy for each Party having equal legal effect.\n\n5. In witness whereof, the undersigned hereby acknowledge that they have read and understand the terms of this Agreement, and that by signing this Agreement they agree to be bound by all terms, conditions, and obligations contained herein.\n\n---\n\n## SIGNATURES AND DETAILS OF THE PARTIES\n\n### \"MERCHANT\"\nBy: **NOXIOUS LIMITED**\nName: Anastasiia Chervona\nTitle: Director\n\nSignature: _____________________\n\n---\n\n### \"COMPANY\"\nBy: **SMARTFLOW PAYMENTS LIMITED**\nName: Anastasiia Pervushyna\nTitle: Director\n\nSignature: _____________________\n\n---\n\n---\n\n# ADDITIONAL AGREEMENT No. 2\n## to the PAYMENT MANAGEMENT SERVICES AGREEMENT No. 2203-24\n\nThis ADDITIONAL AGREEMENT No. 1 (the \"Additional Agreement\") is concluded in 4th September 2024 to the PAYMENT MANAGEMENT SERVICES AGREEMENT No. 2203-24 dd 22.03.2024 (the \"Agreement\") by and between:\n\n**NOXIOUS LIMITED**, a legal entity duly established and acting under the laws of the United Kingdom, with the registered number 14657425, registered office is at: 85 Great Portland Street, First Floor, London, England, W1W 7LT, represented by the Director Anastasiia Chervona (hereinafter referred to as \"Merchant\"), and\n\n**SMARTFLOW PAYMENTS LIMITED**, a legal entity duly established and acting under the laws of the United Kingdom with the registered number 11070048, whose registered office is at: Office 39.18, Level39, One Canada Square, London, E14 5AB, represented by the Director Anastasiia Pervushyna, (hereinafter referred to as the \"Company or SPL\")\n\nMerchant and Company are hereinafter sometimes referred to individually as \"Party\" and together collectively as \"Parties\".\n\n---\n\n## 1. Subject of the Additional Agreement:\n\n1.1 Parties decided to change EXHIBIT A to the following:\n\n---\n\n### \"EXHIBIT A – COMPANY FEE. COMPANY PAYMENT OPTIONS\n\n#### COMPANY FEE\n\nThe Company Fee shall be calculated at the rates specified below with regard to each payment method and shall be withheld by the Company from the Transaction Amounts.\n\n#### CURRENCY\n\nAll payments to the Merchant under this Agreement shall be made in EURO (the \"Currency of the Agreement\"). In the event that Company receives the Transaction amounts in the currencies other than the Currency of the Agreement, the Company shall, at Company's cost, convert the said amounts into the Currency of the Agreement based upon the selling exchange rate published by the XE.COM INC. on their website https://www.xe.com/ as of the day when the settlement is due to be made by the Company to the Merchant current account.\n\nThe Merchant, its subsidiaries and affiliates own and/or operate the websites https://skinsmagnate.com/ through which consumers may purchase and utilize various interactive content, virtual goods and/or services in Euro and/or GBP.\n\n#### PAYMENT METHODS\n\nThe Company shall have the right to make the following payment methods available to the Merchant through the Company Platform for the fees described below applicable to the electronically disbursement to a bank account in EUR:\n\n| No. | Online services | Company Fee, % |\n|-----|-----------------|----------------|\n| 1. | Internet acquiring, EUR | **3.8 %** |\n| | Apple Pay and Google Pay | **5.0 %** |\n| | | |\n| | Internet acquiring, GBP | **4,8%** |\n| | Apple Pay and Google Pay | **5.0 %** |\n| 2. | Chargeback | **50 EUR** |\n| | Refund | **5 EUR** |\n| | RR | **10% /180 days, max 250,000 EUR** |\n\nThe Parties agreed that all bank charges and commissions accrued by the Company's bank and the Merchant's bank will be paid by the Company.\"\n\n---\n\n## 2. Effective Date and Remaining Provisions\n\n2. This Additional Agreement will come into force 9th September 2024.\n\n3. All provisions of the Agreement not affected by this Additional Agreement shall remain in force.\n\n4. This Additional Agreement is executed in two copies, in English versions, one copy for each Party having equal legal effect.\n\n5. In witness whereof, the undersigned hereby acknowledge that they have read and understand the terms of this Agreement, and that by signing this Agreement they agree to be bound by all terms, conditions, and obligations contained herein.\n\n---\n\n## SIGNATURES AND DETAILS OF THE PARTIES\n\n### \"MERCHANT\"\nBy: **NOXIOUS LIMITED**\nName: Anastasiia Chervona\nTitle: Director\n\nSignature: _____________________\n\n---\n\n### \"COMPANY\"\nBy: **SMARTFLOW PAYMENTS LIMITED**\nName: Anastasiia Pervushyna\nTitle: Director\n\nSignature: _____________________\n\n---\n\n---\n\n# SERVICES AGREEMENT (BLIK)\n## GENERAL TERMS AND CONDITIONS\n\n**Location:** London\n**Date:** October 18, 2024\n\n**Docusign Envelope ID:** C76B5B05-3763-4EA0-B36C-FC9B899312D9\n\n---\n\n## Preamble\n\n**PAYMENTZ LTD** is a licensed payment institution which was authorised to provide payment services under Licence 924263 issued by the FCA UK, principal place of business: 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ, Registration number: 12431685, duly represented by Director Deniss Sadovenko, hereinafter referred to as the \"Company\", acting on the basis of the Charter;\n\n**NOXIOUS LIMITED** is a company registered under the legislation of England and Wales, principal place of business: 85 Great Portland Street, First Floor, London, England, W1W 7LT, Registration number: 14657425, duly represented by its Director Anastasiia Chervona, hereinafter referred to as the \"Customer\", acting on the basis of the Charter.\n\nThe Customer intends to engage the Company to provide the Company's Services mentioned herein for the benefit of the Customer's Clients;\n\nTherefore, the Parties have entered into this Services Agreement (the Agreement) as per The Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017, Proceeds of Crime Act 2002, The Financial Services and Markets Act 2000 (FSMA) and the others documents on the prevention of the use of the financial system for the purposes of money laundering or terrorist financing (the AML/CFT Law) and have agreed as set forth below.\n\n---\n\n## 1. DEFINITIONS\n\nAll capitalised terms used in this Agreement (including all and any amendments and appendices hereto) shall have the meaning described in this Section, except as otherwise provided herein or as the context may otherwise require.\n\n1.1. **Agreement** means this agreement for services executed by and between the Parties together with all its annexes as well as subsequent amendments and supplements.\n\n1.2. **Applicable Laws** mean all applicable provisions of all laws, treaties, regulations, orders of governmental authorities and all orders and decrees of all courts and arbitrators that are applicable to the Parties.\n\n1.3. **API** means an open communication technical interface which is based on RESTful architecture and is compliant with EBA-RTS requirements.\n\n1.4. **Beneficial Owner** has the meaning defined in the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017 and other Applicable Laws.\n\n1.5. **Company** means a licensed payment institution which was authorised to provide payment services under Licence 924263 issued by the FCA UK, principal place of business: 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ, Registration number: 12431685, duly represented by Director Deniss Sadovenko, acting on the basis of the Charter.\n\n1.6. **Company's Website** is a https://paymentz.co.uk.\n\n1.7. **Customer's Client** means a natural or a legal person to whom the Customer provides services and grants the right to use the platform/website managed by the Customer.\n\n1.8. **Customer Websites** mean the Customer websites (as approved by the Company) through which the Customer's Clients and/or Persons may access Customer's products and/or services.\n\n1.9. **Financial Partners** means the partners of the Company having the relevant licence (AEMI, EMI, small EMI, API and Payment Institution or their analogue) which may be involved in the process of providing services, acceptance and pay-out of the funds and information exchange for the purposes of proper providing services by the Company to the Customer;\n\n1.10. **Information** means payer's identification code and payment amount and all other information related to the Customer (Related Persons of the Customer) Customer's Client and/or Person that becomes known to the Company from the Customer for the purposes of execution of the Agreement and performance of the services hereunder.\n\n1.11. **Parties** mean the Company and Customer collectively.\n\n1.12. **Payment Initiation or Payment Initiation Service** means a payment instruction initiated by the Company at the request of the Person and/or Customer's Client to transfer funds for the products and/or services of the Customer and/or Customer's Client from the account of the Person and/or Customer's Client.\n\n1.13. **Person** means a person who is a client of the Customer's Client and who initiates the payment for the products and/or services of the Customer's Client using the Payment Initiation Service through the Customer's platform.\n\n1.14. **Price of Services** means the consideration of the Customer paid for the Services provided.\n\n1.15. **Related Persons** is the person or entity that has the ability to control, or is controlled by, or is under common control with the Customer, control being the power to govern the financial and operating policies so as to benefit from its activities; or exercises significant influence over the entity in making financial and operating decisions, i.e. the power to participate in the financial and operating policy decisions of an entity, but not to control those policies.\n\n1.16. **Sanctions** mean a set of regulations applicable to the Customer and Related Persons of the Customer and/or the Company in connection with any commercial, economic or financial sanctions or embargoes related to corruption, money laundering or terrorist financing.\n\n1.17. **Services**, without limitation, comprise services provided by the Company to the Customer, as described in Section 3 of this Agreement.\n\n1.18. **Special Conditions** mean the part of this Agreement.\n\n---\n\n## 2. SCOPE OF AGREEMENT\n\n2.1. The Company hereby provides the Customer with an opportunity to initiate Payment Initiation Service, as described above, via the Company's Services and its Financial Partners, and the Customer undertakes to accept such Services and pay for it under the terms and conditions contained herein.\n\n2.2. The Company undertakes to provide the Services to the Customer for the benefit of the Customer's Clients and/or Persons. The Customer intends to engage the Company to facilitate the payments for the Customer's services and acquiring services provided to the Customer's Clients and/or Persons.\n\n2.3. The Company provides the Services hereunder in one of two methods: (i) the Customer receives funds from the Customer's Clients and/or Persons to the Customer's bank account from the accounts of the Customer's Clients and/or Persons through the Payment Initiation Service provided by the Company; or (ii) the Company provides the Services of collection the funds from the Customer's Clients and/or Persons through the Payment Initiation Service provided by the Company, and their further repayment to the Customer. The specific method of the Services is specified in Annex 1 of this Agreement.\n\n2.4. In case the method mentioned in Sec. \"ii\" 2.3 of the Agreement applies, the Customer provides and grants the Company consent, order, permission to collect and store Customer's and/or Customer's Clients and/or Persons' funds in current accounts belonging to the Company for the further reimbursement of the funds to the Customer and/or Customer's Client and/or Person. The Customer undertakes to obtain appropriate consent, order, permission, as described above, from each and any Customer's Client and/or Person.\n\n2.5. Notwithstanding above, nothing in this Agreement means, implies or can be considered that the Company offers the Services to the Customer's Clients and/or Persons and/or enters into any direct contract and/or contractual obligations with them. The Parties expressly provided and agreed that Customer bears sole and exclusive responsibility to the Customer's Clients and/or Persons in connection with the Services, with the exception of transfer, remittance, settlement and/or custody of funds of the Customer's Clients and/or Persons as a part of payment services provided by the Company or its Financial Partners for which the Company, or its Financial Partners respectively, bears its sole and exclusive responsibility. The Company shall not be liable for any delay in the provision of the Services other than caused by any action or omission on the part of the Company.\n\n---\n\n## 3. SERVICES\n\n3.1. From the date first mentioned above (the \"Effective date\") and for the period of validity of the Agreement or until it is terminated as described below the Company undertakes to provide the Customer with an opportunity to facilitate payments using the Payment Initiation Service provided by the Company.\n\n3.2. The Company within ten (10) business days after the Effective date shall provide the Customer with the identification code via API allowing the Customer to gain an access to the Company's Payment Initiation Service which made the Payment Initiation transaction available for the Customer, Customer's Client and/or Person (depending on who shall initiate the transaction).\n\n3.3. After the access to the Payment Initiation Service is received, the Company starts to provide the Customer, Customer's Client and/or Person (depending on who had initiated the transaction) via API with a respective notice confirming the completion of the Payment Initiation transaction.\n\n---\n\n## 4. RIGHTS AND OBLIGATIONS OF THE COMPANY\n\n4.1. **The Company shall:**\n\n4.1.1. ensure the implementation of high standards for API quality;\n\n4.1.2. provide to the Customer technical specifications in order to access and start using the Services;\n\n4.1.3. request the Customer to change settings for technical integration of the Services. In such a case the Company shall provide the Customer with the updated instructions;\n\n4.1.4. provide the Services in a professional, careful and diligent manner in accordance with the provisions of the Agreement and Applicable Laws;\n\n4.1.5. negotiate any derogations from the terms of the Agreement that may negatively affect on the provision of the Services;\n\n4.1.6. provide the Services to Customer in case the Customer fully performed his obligations described in Clauses 5.1.13. and 5.1.14. hereof;\n\n4.1.7. provide information related to and performed of this Agreement to national and international supervisory authorities in case the Applicable Law is expressly prescribe such actions or respective request have been received by the Company;\n\n4.1.8. provide the Customer an opportunity to receive the information about the results of execution of the Customer's Client's and/or Person's payment order (depending on who had initiated the transaction) and promptly inform the Customer in cases when funds cannot be credited due to errors in the payment order or insufficiency of information.\n\n4.2. For the purpose of ensuring successful performance under this Agreement the Company shall:\n\n4.2.1. receive the Information from the Customer in order to start providing the Service to the Customer;\n\n4.2.2. choose the methods and means of performance of this Agreement using high quality level, best standards and efforts;\n\n4.2.3. comply with the Applicable Laws, regulations, recommendations of the supervisory authorities and the terms of this Agreement.\n\n4.3. To ensure full availability of the Company's information system and to mitigate, prevent and avoid potential losses and damages of the Parties, the Company at any time has the right to carry out technical or other works relating to the eliminating the malfunctions in the Company's information system in order upgrading the hardware and software package and ensure high quality of the Services. In this case, the Company is obliged to notify the Customer in advance about the proposed work through the Company's website. The Company shall perform such works within the shortest period reasonably possible. During the elimination of malfunctions in the information system, the fulfilment of all obligations of the Customer performed through the information system may be suspended. The Company shall not be responsible for each and any Customer's loss or damage resulting from the elimination of malfunctions in the Company's information system.\n\n---\n\n## 5. RIGHTS AND OBLIGATIONS OF THE CUSTOMER\n\n5.1. **The Customer shall:**\n\n5.1.1. accept the Services provided by the Company and pay the Price of Services;\n\n5.1.2. notify the Company of the Bank account details of the Customer, Customer's Client and/or Person to be used for transfer of funds;\n\n5.1.3. promptly notify the Company of the change of details of the Bank account of the Customer to be used for transfer of funds;\n\n5.1.4. promptly notify the Company of the Customer's Website and changes in the Customer's Website address and/or changes of goods and/or services offered in the Customer's Website;\n\n5.1.5. ensure that the Customer's Website provides relevant, complete, accurate and transparent information about the Customer, offered goods and/or services, the main pre-contractual information and other relevant information including but not limited to: (i) the Customer's name, company or other registration number, registered office address; (ii) the Customer's contact details; (iii) the Customer's terms of cancellation of the services; (iv) data protection policy;\n\n5.1.6. provide the Company with the complete and accurate information reasonably necessary to ensure the proper execution the Services or which is reasonably requested by the Company in written form;\n\n5.1.7. have obtained all permits and licences required by the Applicable Laws in order to enter into this Agreement and provide the services to the Customer's Clients and/or Persons;\n\n5.1.8. comply with the Company's reasonable directions and request with regard to the testing of the Services integration between the Customer's and the Company's information system. The Customer hereby acknowledge and accept that incorrect integration of the information systems of the Parties may affect the execution of this Agreement and the Payment Initiations made hereunder;\n\n5.1.9. be solely liable for the settlement with the Customer's Clients and/or Persons using the agreed settlement method, save in respect of the payment services as provided in Clause 2.5. hereof;\n\n5.1.10. follow the Company's instructions to implement the requested changes and/or updates of the Services in order to continue the use of the Services;\n\n5.1.11. strictly refrain from making any representations and warranties to the Customer's Clients and/or Persons on behalf of the Company in relation to the Services;\n\n5.1.12. complete the \"Know Your Customer\" (KYC) questionnaire by complying with the requirements of money laundering and terrorist financing prevention acts, sanctions and other legal acts designated to and based on KYC and anti-money laundering and/or combating the financing of terrorism principles;\n\n5.1.13. bear full responsibility for the completeness and accuracy of the information in the KYC questionnaire;\n\n5.1.14. notify the Company within 5 (five) business days from the moment the changes of details or information indicated in the KYC questionnaire (including information on Beneficial owners, shareholders, managers, directors, authorized persons legal entity type (form), name, legal status, main activity, address, financial standing, website, clients and etc.) come into force;\n\n5.1.15. refrain from any of the following actions:\n(a) spreading computer viruses and using other measures that might disrupt the operation of the Company's information systems, harm or destroy information and cause any other damage to the systems, equipment or information;\n(b) any other deliberate actions that would disrupt the provision of the Services or the operation of API and/or the Company's information systems;\n(c) organising illegal gambling, prostitution services, trading in tobacco products, alcohol, prescription drugs, narcotic substances and drug-related merchandise, steroids, weapons, pornographic material, unlicensed lotteries, illegal software and other items or products prohibited by law;\n(d) provision of services prohibited by law.\n(e) other illegal services.\n\n5.2. The Customer hereby acknowledges that the Company commences providing the Services only if the Customer submits all and any information and documents reasonably requested by the Company to perform KYC procedures and assessment of the risks imposed by the Customer and Customer's Website and the submitted documentation regarding KYC procedure are confirmed by the Company.\n\n5.3. The Customer shall also have other rights and obligations specified in the Agreement and Applicable Laws.\n\n---\n\n## 6. DISRUPTION OR SUSPENSION\n\n6.1. The Company shall not be liable for any disruption in any Services due to, but not limited to failure of the hardware, software or other infrastructure used by the Company, disruption of internet connection, API interface or other technical breakdowns, which does not qualify as Force Majeure circumstance, provided the Company makes reasonable efforts to restore the Services in order to avoid potential losses for itself and/or the other Party.\n\n6.2. The Company shall be entitled to suspend and/or terminate the provision of the Services in case of the breach of the terms of the Agreement by the Customer, upon provision of reasonable evidence of such breach.\n\n---\n\n## 7. GENERAL RIGHTS AND OBLIGATIONS OF THE PARTIES\n\n7.1. The Parties shall fulfil obligations assumed under the Agreement in full accordance with the Applicable Laws and in a good faith and a timely manner.\n\n7.2. The Parties shall notify each other of works to be carried out in the information systems which may affect the provision of the Services under this Agreement:\n\n7.2.1. known scheduled works – no later than one (1) business day before the commencement of scheduled works;\n\n7.2.2. unscheduled preventive works or failures – promptly.\n\n7.3. The Company shall provide information on all scheduled and unscheduled works through the Company's website.\n\n7.4. No later than fifteen (15) calendar days in advance either Party shall notify the other Party of any changes in its website and/or online store that may affect the provision of Services. Upon receipt of the relevant information, the other Party shall procure that all required changes shall be made in the information systems used by it in a timely manner.\n\n---\n\n## 8. REPRESENTATIONS AND WARRANTIES OF THE PARTIES\n\n8.1. Each Party hereby represents and warrants to the other Party that:\n\n8.1.1. the Party is lawfully established and validly existing under the laws of the country of its incorporation;\n\n8.1.2. the Party has the necessary power, authority and approvals to execute and perform this Agreement which constitutes a valid and binding obligation of the respective Party enforceable against the Party in accordance with its terms;\n\n8.1.3. the Party has taken all legal actions required to properly enter into and give effect to this Agreement, has obtained all permits and licenses required by law and has the employees required for the delivery or receipt of the Services;\n\n8.1.4. neither the execution of this Agreement nor compliance by the Parties with the obligations assumed hereunder conflicts with, or results in a breach or violation of, any of the terms and provisions of (i) any decision, judgment, order, decree or instruction or injunction of any court, public or municipal authority to which the Parties are subject; (ii) any agreement or any other transaction to which the respective Party is a party; or (iii) any law or other regulation applicable to the Parties; (iv) the rights and lawful interests of the creditors or shareholders of the Parties.\n\n---\n\n## 9. CONFIDENTIALITY OBLIGATIONS\n\n9.1. The Parties shall not disclose any Information provided to it during the performance of the Agreement or related to the performance of the Agreement to any third party and shall not make available such Information, either in full or in part, to any third party during the term of the Agreement and thereafter for an indefinite period without the prior written consent of the other Party, unless such disclosure is required by the Applicable Laws.\n\n9.2. All information provided by either Party shall be deemed confidential and shall be provided solely for the benefit of the other Party. The Parties shall not disclose, mention in public or make available such information to any third party, except where such disclosure is required by the mandatory provisions of the Applicable Laws, or with the prior written consent of the other Party to each specific disclosure, whose consent shall not be unreasonably withheld.\n\n9.3. The confidentiality obligation shall not apply in respect of the above information (except for personal data) if:\n\n9.3.1. it is in the public domain;\n\n9.3.2. it becomes generally known to the public otherwise than through the breach of this obligation;\n\n9.3.3. it was lawfully obtained by the Party prior to the execution of the Agreement;\n\n9.3.4. it has been independently acquired (created, developed, investigated, etc.) by the Party by lawful means;\n\n9.3.5. it was lawfully received by the Party from a third party not under any obligation of confidentiality with respect thereto.\n\n---\n\n## 10. PERSONAL DATA\n\n10.1. The Parties act as independent data controllers and shall process the various personal data obtained during the performance of the Agreement as required by GDPR law and shall ensure the protection of personal data made available to them at their own cost and expense and by their own means. The Parties shall execute a separate agreement regarding the processing of personal data which constitutes an integral part of the Agreement.\n\n---\n\n## 11. LIABILITY OF THE PARTIES\n\n11.1. The Company shall be held liable only for direct losses incurred as a result of the Company's (i) breach of any Applicable Laws, regulatory requirements or contractual provisions; (ii) breach of any material obligations set forth in this Agreement; (iii) wilful misconduct or deliberate conduct of any employee of the Company in connection with the obligations of the Company under this Agreement. The Company shall not be liable for consequential or indirect losses, such as loss of profits, opportunity or reputation or resulting from the circumstances specified in Clause 4.3.\n\n11.2. The Company's liability shall not exceed the amount of fees paid by the Customer to the Company for the last twelve (12) months for the provision of the Services. If the average of twelve (12) months cannot be calculated, the compensation shall be calculated at the minimum extent of the actual duration of the usage of the Services.\n\n11.3. The Customer shall be liable only for the direct losses which are from or are incurred by reason of the Customer's (i) breach of any Applicable Laws, regulatory requirements or contractual provisions; (ii) breach of any material obligations set forth in this Agreement; (iii) wilful misconduct or deliberate conduct of any employee of the Customer in connection with the obligations of the Customer under this Agreement. The maximum aggregate liability of the Customer, or any of its employees or consultants, for any and all direct damages, whether for negligence, breach of contract, misrepresentation, or otherwise, in respect of a single occurrence or a series of occurrences, shall in no circumstance exceed the total amount of fees paid by the Customer to the Company for the 12 (twelve) months prior to the time the event giving rise to the liability arose.\n\n11.4. The Parties shall not be liable to indemnify damages that result from any failure in the communication lines or interruption in power supply, preventive works carried out in relation to the information systems of the Party that have been notified by the Party to the other Party.\n\n11.5. The Company shall not be liable for the goods and/or services of the Customer (e.g. quality of the good, delivery, etc.), the operation of the Customer's Website, the content and information contained therein, as well as solving or mediating disputes between the Customer's Client and the Customer.\n\n11.6. The Customer shall indemnify the Company for all direct and proven penalties or fines imposed by the regulatory authorities and incurred by the Company, upon provision of reasonable evidence of such penalties or fines, if these arise from or are incurred by reason of the Customer's breach of any Applicable Laws requirements under anti-money laundering, terrorist financing, fraud or any other financial crime laws and regulations.\n\n11.7. In the event of the failure by the Customer to pay the Price of Services to the Company, either in full or in part, when due, the Customer shall be liable to pay an interest rate of 0.05 per cent of the unpaid amount of the Price of Services for each day of delay to the Company.\n\n---\n\n## 12. AMENDMENTS OF THE AGREEMENT\n\n12.1. The Company may unilaterally amend and/or supplement the Agreement by notifying the Customer no later than sixty (60) calendar days before the amendments enter into force.\n\n12.2. The Customer may agree or disagree with such changes as specified in Clause 12.1. prior to the proposed enforcement date of such changes:\n\n12.2.1. it shall be considered that the Customer agrees with such changes and the proposed changes shall enter into force on the specified enforcement date if prior to the day of their enforcement the Customer does not notify the Company of the disagreement with the changes;\n\n12.2.2. the Customer, who disagrees with the changes proposed by the Company, shall have the right to terminate the Agreement without commission applied by notifying the Company in writing prior to the proposed enforcement date of such changes.\n\n12.3. The sixty (60) days' notice period will not apply where the changes relate to the addition of a new service or extra functionality to the existing Services. In such instances, the changes will be made and shall be effective immediately upon giving the Customer notice of it.\n\n12.4. The Customer is not entitled to object to and shall not have the rights set out in this clause for any change, which the Company implements in order to comply with Applicable Law. For such imposed changes shorter notice periods may be imposed.\n\n---\n\n## 13. VALIDITY AND TERMINATION OF THE AGREEMENT\n\n13.1. The Agreement shall enter into force from the date firstly indicated above (the Effective date) and shall keep its validity, be in full force and legally binding until terminated by the Parties under procedure set forth below herein.\n\n13.2. This Agreement may be terminated by written agreement of the Parties.\n\n13.3. Either Party has the right to terminate the Agreement unilaterally without any reason upon thirty (30) calendar day's prior written notice thereof to the other Party.\n\n13.4. The Company may terminate the Agreement immediately in case:\n\n13.4.1. the Customer fails to submit the KYC questionnaire or submitted information in the KYC questionnaire is inaccurate, incorrect or not indicated;\n\n13.4.2. the Customer fails to inform the Company within five (5) business days from the moment the changes of details indicated in the KYC questionnaire (including, but not limited to information of Beneficial Owners, shareholders, managers, legal entity type (form), name, legal status, main activity, address, financial standing, website, clients) come into force;\n\n13.4.3. in order to prevent money laundering and terrorist financing, the Customer fails to provide documents and/or information requested by the Company, or provides information or documents that do not comply with legal requirements or there are reasonable doubts whether documents and/or information provided by the Customer are true, accurate and complete;\n\n13.4.4. the Customer fails to provide evidence and/or documents proving the legal basis and/or origin of the funds or other assets, or there are other circumstances that suggest that the Customer is involved in money laundering and/or terrorist financing;\n\n13.4.5. the Customer's business risk level changes and can no longer be considered acceptable to the Company;\n\n13.4.6. the Customer breaches or the Company has grounds to reasonably suspect that the Customer may be in breach of any Applicable Law requirements and the Company provides written proof of the reasonable grounds for such suspicion;\n\n13.4.7. the Customer engages or the Company has grounds to reasonably suspect that the Customer may be engaged in prohibited activities set forth in Clause 5.1.15 of this Agreement and the Company provides written proof of the reasonable grounds for such suspicion;\n\n13.4.8. the Customer's activity is likely to harm the Company's or third parties justified interests or business reputation and the Company provides written proof of the reasonable grounds therefor;\n\n13.4.9. the Company is required to do so by the Applicable Law or financial regulator of the Company and the Company provides written proof of the reasonable grounds therefor;\n\n13.4.10. the Customer and/or natural person related to the Customer and/or any of their managers, employees, representatives, Beneficial Owners that are:\n(a) listed on any Sanctions list or targeted by Sanctions (whether designated by name or by reason of being included in a class of person); or\n(b) located in or incorporated under the laws of any country or territory that is the target of Sanctions; or\n(c) directly or indirectly owned or controlled by, or acting on behalf of, at the direction or for the benefit of, a person referred to in (a) above and/or to the extent relevant under (b) above.\n\n13.4.11. the Company would be prohibited or restricted by Sanctions from transacting or dealing with (including but not limited to entering into an Agreement) or otherwise exercising any rights in respect of, or fulfilling any duties or obligations owed to such a person;\n\n13.4.12. the Customer and/or natural person related to the Customer and/or any of their managers, employees, representatives, Beneficial Owners are subject to a complaint, claim, inspection, case or investigation relating to any Sanctions imposed by any supervisory or law enforcement authority or third party.\n\n13.5. The Company has the right to unilaterally terminate this Agreement and suspend the provision of the Services of the following measures indicated in Clause 13.4. with immediate effect and notify the Customer in writing thereof.\n\n13.6. Upon termination of this Agreement of the following measures indicated in Clause 13.4., the Company is not liable for losses incurred by the Customer due to suspension of the Services provision. The Customer confirms and clearly understands the consequences of failing to comply with legal obligations.\n\n13.7. The provisions of the Agreement on confidentiality, mutual settlement and other obligations of the Parties arising prior to the termination of the Agreement shall survive termination or expiration of this Agreement until such time as the Party has settled with the other Party and duly fulfilled other obligations under the Agreement.\n\n13.8. Upon termination of the Agreement, the Customer shall immediately remove all information related to the Services on the relevant Customer's Website.\n\n---\n\n## 14. DISPUTE RESOLUTION AND GOVERNING LAW\n\n14.1. Any controversy or dispute arising between the Parties in connection with this Agreement shall be resolved amicably by the Parties. Failing that, all disputes, controversies or claims arising out of or related to this Agreement, its breach, termination or validity shall be resolved by a competent court in London, England.\n\n14.2. This Agreement shall be governed by and interpreted in accordance with the law of England and Wales.\n\n---\n\n## 15. NOTICES\n\n15.1. Any and all notices, approvals and other communications that may be made or given by a Party under this Agreement shall be deemed valid if delivered to the other Party in person with acknowledgement of receipt or sent by registered mail or e-mail at the respective address specified in the Special Conditions or such other address as either Party may notify to the other.\n\n---\n\n## 16. FINAL PROVISIONS\n\n16.1. The Party shall not be entitled to assign its rights and obligations under this Agreement, either in whole or in part, to any third party without the prior written consent of the other Party.\n\n16.2. The Parties confirm that they have read the Agreement thoroughly and understand its content and are prepared to assume the general rights and obligations set out in the Agreement.\n\n16.3. All title and copyright, trademarks and service marks, patents and all other intellectual property rights related to the Services shall belong to the Company.\n\n16.4. If any provision of this Agreement is or becomes invalid, either in full or in part, this shall not render invalid the remaining provisions of this Agreement. In that case the Parties shall agree to conclude as promptly as possible an additional arrangement or agreement replacing the invalid provisions of this Agreement with legally enforceable provisions which, to the extent possible, have the same economic and legal effect as the original provision of the Agreement that has become invalid.\n\n16.5. This Agreement, including related documents, executed, scanned and transmitted electronically and electronic signatures are deemed original signatures for purposes of the Agreement and all matters related thereto, with such electronic signatures having the same legal effect as original signatures.\n\n---\n\n## SIGNATURES\n\n**On behalf of the Company**\nDeniss Sadovenko (Director)\n\n*DocuSigned by: Deniss Sadovenko*\n*9AC222D95A1B4E7...*\n\n---\n\n**On behalf of the Customer**\nAnastasiia Chervona (Director)\n\n*Signed by: Anastasiia Chervona*\n*07513791BFBB410...*\n\n---\n\n---\n\n# SERVICES AGREEMENT - SPECIAL CONDITIONS\n\n**Location:** London\n**Date:** October 18, 2024\n\n---\n\n## 1. Parties\n\n### 1.1. Company\n\n| Field | Value |\n|-------|-------|\n| Name of legal entity | PAYMENTZ LTD. |\n| Registration number | 12431685 |\n| Address | 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ |\n| Address for correspondence | 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ |\n| Tel. | +44 7308 698161 |\n| E-mail | info@paymentz.co.uk; deniss@paymentz.co.uk |\n| Bank account | |\n| Name, surname and position of representative | Deniss Sadovenko; Director/CEO |\n| Ground for representation | Articles of Association of the Company |\n\n### 1.2. Customer\n\n| Field | Value |\n|-------|-------|\n| Name of legal entity | NOXIOUS LIMITED |\n| Legal entity code | 14657425 |\n| VAT number | |\n| Registered office address | 85 Great Portland Street, First Floor, London, England, W1W 7LT |\n| Address for correspondence | 85 Great Portland Street, First Floor, London, England, W1W 7LT |\n| Tel. | |\n| E-mail | info@skinsmagnate.com |\n| Bank account | Virtual Account Name NOXIOUS LIMITED, SWIFT/BIC PYYPGB21, Virtual IBAN GB17PYYP00993910001108, Payments Institution Name My EU Pay Ltd., Payments Institution Address 24 King William Street, London, EC4R 9AT, Payments Institution Country United Kingdom, Currency EUR (reachable via SEPA only), Reachability SEPA (SCT & SCT Inst only) |\n| Respondent Websites | https://skinsmagnate.com/ |\n| Name, surname and position of representative | Anastasiia Chervona, Director |\n\n---\n\n## 2. Price of Services and Payment Terms\n\n### 2.1. Price of Services\n\n**BLIK T&C - 2%+0.1 Euro for each transaction**\n\nThe Price of Services is stated exclusive of the value added tax, which, if applicable, shall be paid in addition as required by law.\n\n### 2.2. Payment terms\n\nThe amount payable for each month shall be calculated based on the actual number of transactions performed by the Customer's Client and/or Person during the previous calendar month. For the avoidance of doubt, the Parties agree that in the case of a series of payments made by a single Customer's Client and/or Person as payer, invoices shall be issued for each individual Payment Initiation action.\n\nThe Customer shall pay the Company for the Services based on invoices issued by the Company. The Company shall issue an invoice to the Customer until the 7th day of the following month according to the actually provided Payment Initiation services.\n\nThe Customer shall pay the Price of Services based on submitted invoices until the 20th day of each month by transfer of funds to the Company's account provided in the invoice.\n\nIt is expressly understood and agreed that in connection with the Services to be performed by the Company, the Company shall be solely responsible for any and all taxes arising from the fees, the Price of Services or any reimbursement paid to the Company hereinafter.\n\n---\n\n## 3. Amendments to the General Conditions\n\nNone\n\n---\n\n## 4. Other Special Conditions\n\nNone\n\n---\n\n## 5. Annexes to the Agreement\n\n| Applicable | No | Title of the Annex |\n|------------|----|--------------------|\n| X | 1 | Service Agreement General Conditions |\n\nThe Parties confirm that they have negotiated and agreed on the Special Conditions, the General Conditions and Annexes of the Agreement marked above that all make this entire Agreement.\n\n---\n\n## 6. Signatures of the Parties\n\n6.1. The Parties confirm that all terms and conditions of the Agreement have been individually discussed by the Parties, are understandable and correspond to the real will of the Parties.\n\n**On behalf of the Company:**\nDirector/CEO: Deniss Sadovenko\n\n*DocuSigned by: Deniss Sadovenko*\n*9AC222D95A1B4E7...*\n\n---\n\n**On behalf of the Customer:**\nDirector: Anastasiia Chervona\n\n*Signed by: Anastasiia Chervona*\n*07513791BFBB410...*\n\n---\n\n---\n\n## Document Information\n\n| Field | Value |\n|-------|-------|\n| Document Type | Payment Management Services Agreement + Additional Agreements + BLIK Agreement |\n| Main Contract Number | 2203-24 |\n| Main Contract Date | 22.03.2024 |\n| Additional Agreement #1 Date | 31.07.2024 |\n| Additional Agreement #1 Effective | 15.07.2024 |\n| Additional Agreement #2 Date | 04.09.2024 |\n| Additional Agreement #2 Effective | 09.09.2024 |\n| BLIK Agreement Date | 18.10.2024 |\n| Main Provider | SMARTFLOW PAYMENTS LIMITED |\n| Main Provider Registration | 11070048 |\n| Main Provider Address | Office 39.18, Level39, One Canada Square, London, E14 5AB |\n| BLIK Provider | PAYMENTZ LTD |\n| BLIK Provider Registration | 12431685 |\n| BLIK Provider FCA Number | 924263 |\n| BLIK Provider Address | 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ |\n| Merchant | NOXIOUS LIMITED |\n| Trading Name | SkinsMagnate |\n| Merchant Registration | 14657425 |\n| Merchant Address | 85 Great Portland Street, First Floor, London, England, W1W 7LT |\n| MCC | 5816 |\n| Website | https://skinsmagnate.com/ |\n| Settlement Currency | EUR |\n| Merchant IBAN | GB17PYYP00993910001108 |\n| Merchant BIC | PYYPGB21 |\n| Bank | My EU Pay Ltd. |\n| Provider IBAN | LT463880010100316908 |\n| Provider BIC | GLUALT22XXX |\n| Provider Bank | Payswix, UAB |\n| Docusign Envelope ID (BLIK) | C76B5B05-3763-4EA0-B36C-FC9B899312D9 |\n| Total Pages | 14 (Combined) |\n\n---\n\n## Fee Summary\n\n| Service | Currency | Fee |\n|---------|----------|-----|\n| Internet acquiring (Card) | EUR | 3.8% |\n| Internet acquiring (Card) | GBP | 4.8% |\n| Apple Pay / Google Pay | EUR/GBP | 5.0% |\n| BLIK | PLN | 2% + 0.1 EUR |\n| Chargeback | - | 50 EUR |\n| Refund | - | 5 EUR |\n| Rolling Reserve | - | 10% / 180 days / max 250,000 EUR |\n\n```",
  "plan": {
    "contract_id": "2203-24",
    "company_name": "NOXIOUS LIMITED",
    "trading_name": "SkinsMagnate",
    "company_address": "85 Great Portland Street, First Floor, London, England, W1W 7LT",
    "company_registration_number": "14657425",
    "provider_name": "SMARTFLOW PAYMENTS LIMITED",
    "provider_registration_number": "11070048",
    "provider_address": "Office 39.18, Level39, One Canada Square, London, E14 5AB",
    "secondary_provider": {
      "name": "PAYMENTZ LTD",
      "registration_number": "12431685",
      "fca_number": "924263",
      "address": "2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ",
      "service": "BLIK Payment Initiation"
    },
    "contract_date": "2024-03-22",
    "additional_agreement_1_date": "2024-07-31",
    "additional_agreement_1_effective": "2024-07-15",
    "additional_agreement_2_date": "2024-09-04",
    "additional_agreement_2_effective": "2024-09-09",
    "blik_agreement_date": "2024-10-18",
    "contract_expiry": null,
    "term": "Indefinite (30 days notice to terminate)",
    "governing_law": "England and Wales",
    "mcc": "5816",
    "urls": [
      "https://skinsmagnate.com/"
    ],
    "settlement_currency": "EUR",
    "rolling_reserve": {
      "percent": 10.0,
      "hold_days": 180,
      "cap_eur": 250000.0
    },
    "fees": [
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:card:EUR:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:card:EUR:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 4.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:card:GBP:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 4.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:card:GBP:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "apple_pay",
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:apple_pay:EUR:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "apple_pay",
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:apple_pay:EUR:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "google_pay",
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:google_pay:EUR:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "google_pay",
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:google_pay:EUR:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "apple_pay",
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:apple_pay:GBP:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "apple_pay",
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:apple_pay:GBP:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "google_pay",
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:google_pay:GBP:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "google_pay",
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 5.0,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Additional Agreement #2 to Contract 2203-24, EXHIBIT A",
        "contract_ref": "2203-24:incoming:apm:google_pay:GBP:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "apm",
        "apm_type": "blik",
        "currency": "PLN",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 2.0,
        "payout_percent": null,
        "fixed_fee": 0.1,
        "refund_fee": null,
        "chb_fee": null,
        "exchange_fee_percent": null,
        "source": "PAYMENTZ LTD BLIK Services Agreement, Special Conditions",
        "contract_ref": "BLIK-2024-10-18:incoming:apm:blik:PLN:EU"
      }
    ],
    "settlement_accounts": {
      "merchant": {
        "account_holder": "NOXIOUS LIMITED",
        "iban": "GB17PYYP00993910001108",
        "bic": "PYYPGB21",
        "bank_name": "My EU Pay Ltd.",
        "bank_address": "24 King William Street, London, EC4R 9AT"
      },
      "provider": {
        "account_holder": "SMARTFLOW PAYMENTS LIMITED",
        "iban": "LT463880010100316908",
        "bic": "GLUALT22XXX",
        "bank_name": "Payswix, UAB",
        "bank_address": "Lvovo g. 25-104, LT-09320 Vilnius, Lithuania"
      }
    },
    "contacts": {
      "merchant": {
        "name": "Anastasiia Chervona",
        "email": "ceo@skinsmagnate.com",
        "phone": null
      },
      "provider": {
        "name": "Anastasiia Pervushyna",
        "email": "apa@sends.co"
      },
      "blik_provider": {
        "name": "Deniss Sadovenko",
        "email": "deniss@paymentz.co.uk",
        "phone": "+44 7308 698161"
      }
    }
  }
}