{
  "contract_id": "2025/2910-01",
  "company_name": "TERRAGAMINEX LIMITED",
  "filename": "TERRAGAMINEX_LIMITED_contract",
  "markdown": "```markdown\n# GATEWAY SERVICES AGREEMENT Nr. 2025/2910-01\n\n**Docusign Envelope ID:** 2F487180-E467-4BE7-B99B-670F3AB39F94\n\n---\n\nThis Gateway Payment Agreement (hereinafter referred to as the Agreement), made on **29.10.2025** (\"the Effective Date\") by and between\n\n**FINTHESIS LTD**, registered in United Kingdom, bearing Company registration number **12431685**, Company Reference Number **924263** and having its registered address at **2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ**, hereinafter referred to as \"FINTHESIS\", duly represented by **Yuliia NIKULINA**, acting on the basis of the Articles of Association, on the one hand, and\n\n**TERRAGAMINEX LIMITED**, registered in United Kingdom, bearing Company registration number **15922361**, and having its registered address, **Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF**, hereinafter referred to as the \"Merchant\" duly represented by director **Veronika Trubovica**, acting on the basis of statutory documents, on the other hand, collectively referred to as the \"Parties\", and individually the \"Party\"\n\n---\n\n## WHERE AS,\n\nFINTHESIS is a Service provider of certain payment services and payment gateway services that facilitate payments for goods and services sold by the Merchant. The Merchant agrees that FINTHESIS in providing the authorisation, processing, and settling of transactions (hereinafter – the Payment Processing Services or the Services), acts as an acquirer and/or as a facilitator on behalf of the Merchant to enter into Card payments with Cardholders and other Payment methods as per request.\n\n---\n\n## Recitals\n\n**WHEREAS**, the Merchant wishes to engage FINTHESIS for the provision of Services described in Section 3 to this Agreement;\n\n**WHEREAS**, FINTHESIS has agreed to supply the said Services on the terms and conditions set out in this Agreement;\n\n**WHEREAS**, it is express objective and intention of the Parties to this Agreement to achieve as high as possible degree of efficiency in their professional relationship, to their mutual benefit;\n\n**NOW, THEREFORE**, in consideration of the above recitals, which recitals are expressly made an integral part of this Agreement, and in Further consideration of the promises, covenants, conditions and mutual obligations hereinafter contained, FINTHESIS and the Merchant agree and covenant as follows;\n\n**NOW THEREFORE**, The Agreement shall determine and govern the legal relationship of the Parties in relation to acceptance of Cards in the Online Store. FINTHESIS and the Merchant hereby agree on the Terms and conditions, under which FINTHESIS will provide the Payment Processing Services and/or other services, and has the right to receive/send payments in respect of the Transactions and pursuant to which the Merchant will be entitled to accept such payment methods on the Merchant's Website(s). FINTHESIS shall not take possession or control of any goods and services sold by Merchant but shall only render payment services.\n\n---\n\n## 1. TERMS AND DEFINITIONS USED IN THE AGREEMENT\n\n1.1. **Accounting Period** – a reference period for calculating total value of Transactions processed and payable to the Merchant.\n\n1.2. **Acquirer** – a bank or financial institution that is a member of the ICO and provides clearing of card transactions.\n\n1.3. **Authorisation** – electronic procedure set out by the International Card Organisation in order to obtain the Issuer's Authorisation to effect a Card Payment after proper verification of the Card and Transaction Data, as well as identification of the Cardholder.\n\n1.4. **Cards(s)** - means a credit, debit, pre-paid, change of purchase or other card issued by a Card issuer and any other cards which FINTHESIS is able and has agreed to provide gateway processing services (as notified by FINTHESIS to Merchant from time to time).\n\n1.5. **Cardholder (Payer)** – a private person to whom the Card is issued and whose name is embossed or imprinted on the face of the Card, and is the authorized user of a Card.\n\n1.6. **Card issuer(s)** - means Visa, MasterCard, American Express and/or such other organisation governing the issuance and use of Cards including but not limited to their respective members as may be approved and notified by FINTHESIS to Merchant in writing from time to time. Approval to process certain Cards is subject to FINTHESIS's sole discretion.\n\n1.7. **International Card Organisation (ICO)** means any entity formed to administer and promote Cards, including without limitation MasterCard Worldwide (\"MasterCard\"), Visa U.S.A., Inc.(\"Visa\"), DFS Services LLC (\"Discover Network\"), American Express, (\"AXP\") and any applicable debit networks.\n\n1.8. **International Card Organisation Rules (ICO Rules)** mean The rules, regulations, releases, interpretations and other requirements (whether contractual or otherwise) imposed or adopted by any ICO and related authorities, including without limitation, those of the PCI Security Standards Council, LLC and the National Automated Clearing House Association (including, with respect to EBTs, the Quest Operating Rules), PADSS, CISP, SDP, DSOP and DISC.\n\n1.9. **Issuer** - bank that has issued the credit or debit card to the customer.\n\n1.10. **Merchant account Payment Gateway's Backoffice** – registered account within FINTHESIS Payment Gateway.\n\n1.11. **Payment** – an operation of non-cash payment of funds, paid by the Payer in favor of the Merchant for goods/works/services, sold by the Merchant through the Payment Gateway.\n\n1.12. **Payment services** – services provided by the FINTHESIS in accordance with the Applicable Law, as well as in accordance with the approved Terms and Conditions of FINTHESIS, posted on the FINTHESIS's website:\n- services for processing payments, initiated by the Payer in electronic form and transmitting the necessary information to the bank. FINTHESIS performing certain types of banking operations, for making a payment, and (or) transferring or accepting money for these payments.\n\n1.13. **Reimbursement** – an operation, initiated by the Merchant to transfer funds in favour of the Remittee, using the Payment Gateway.\n\n1.14. **Remittee** – a person in whose favour the FINTHESIS makes a Reimbursement at the direction of the Merchant.\n\n1.15. **Payment Gateway** – a software and hardware complex, used by FINTHESIS and providing information and technological interaction between FINTHESIS, the Payer, and the Merchant in the framework of accepting Payments in favor of the Merchant, as well as in the framework of making Reimbursements, initiated by the Merchant in favor of the Remittee.\n\n1.16. **Online Store or E-Shop** - online website of the Merchant where the Merchant offers its goods and services. Each E-Shop shall be approved by FINTHESIS.\n\n1.17. **Personal Account** – a specialized section of the Merchant on the FINTHESIS's website, provided to the Merchant within the framework of the Payment Gateway, providing using of the services mentioned in clause 2.1.3 of the Agreement, as well as providing the Merchant with information on the status of Payments in «real time» mode, uploading the Registers of accepted payments, as well as the Reimbursements register.\n\n1.18. **Register of accepted payments/Reimbursements register** – reports of FINTHESIS, generated automatically by the Payment Gateway. Registers are the basis for signing the Certificate of services rendered, specifying the total amount of services, rendered for the reporting period. The form of the Certificate of services rendered is established by the Parties in Annex No. 4 to the Agreement.\n\n1.19. **Chargeback (Financial Dispute)** – the card issuer's request to return the disputed transaction amount to the cardholder (Payer).\n\n1.20. **Refund** – refund of funds at the request of the Payer, made by the Merchant voluntarily before initiating the Chargeback procedure.\n\n1.21. **Proof of purchase** - a record of a purchase of goods or services, made by a Cardholder, and handed out at the end of a transaction, regardless of whether the form of such evidence is in paper or electronic form or otherwise. All data on prove of purchase must conform to ICO Rules and Applicable Law.\n\n1.22. **Settlement bank** – a bank engaged by the FINTHESIS for the purpose of conducting settlements between the FINTHESIS and the Merchant on completed Card transactions.\n\n1.23. **Transaction** – means a Card Payment (incl. approved and declined Transactions), Refunds and Chargebacks. Card Payment is an operation of non-cash payment of funds, paid by the Cardholder for goods/works/services, sold by the Merchant through the Payment Gateway.\n\n1.24. **Rolling reserve** – a form of deposit in which a share of each transaction is held by the FINTHESIS for a certain time in order to cover possible Refunds, Chargebacks, fines, fees, damages, and other sanctions under the Agreement, or fines, penalties and other sanctions imposed on the FINTHESIS by the ICO, the Settlement Bank, the Bank of England, Financial Conduct Authority, judicial/law enforcement, and/or other authorized state bodies.\n\n1.25. **Data Protector Laws** - means any applicable data protection, privacy or secrecy laws or regulations including the General Data Protection Regulation (GDPR) (EU) 2016/679, the UK Data Protection Regulation the Data Protection Act 2018, any regulations implementing GDPR or any such similar laws and regulations with any subsequent amendments and additions.\n\n1.26. **PCI-DSS** - Payment Card Industry Data Security Standards as released from time to time by the Security Standard Control.\n\n---\n\n## 2. SUBJECT OF THE AGREEMENT\n\n2.1. The Agreement shall determine and govern the legal relationship between FINTHESIS and the Merchant in relation of providing the Services what is subject to the terms of this Agreement, Applicable Law, and the ICO Rules.\n\n2.2. The Merchant agrees that FINTHESIS may, without amending this Agreement, in any cases contract with another acquirer or payment facilitator to provide payment processing functionality (may be subject to amendments to this Agreement).\n\n---\n\n## 3. SERVICES\n\n3.1. FINTHESIS undertakes to provide the Merchant with the following Services:\n\n3.1.1. Ensure the Authorisation of Transactions and transfer of the amounts of Transactions to the Merchant under the provisions of the Agreement.\n\n3.1.2. Provide to the Merchant support with respect to the Cardholder's claims about Transactions at the Online Store.\n\n3.1.3. Inform the Merchant about new requirements of FINTHESIS, caused by changes in internal regulatory documents.\n\n3.1.4. Provide support with technical integration of the Payment gateway into the Merchant's Online Store. Inform the Merchant about new features of the Payment Gateway, that allows to improve data analysing of the Transactions. Provide antifraud tools with the Payment Gateway functionality.\n\n3.1.5. Inform the Merchant via e-mail within 24 hours about any disputed Transaction alert received, requesting the Merchant within the following 72 (seventy two) hours to:\n\n3.1.5.1. present to FINTHESIS Prove of purchase and full set of all documents supporting the Transaction, including those proving delivery of goods or services, which are sufficient for dismissal of the Merchant's claim under the ICO Rules, or\n\n3.1.5.2. execute immediate Refund to the Merchant.\n\n3.1.6. Accept and review claims from the Merchant and the Cardholders about FINTHESIS's activity or inactivity with respect to the Agreement and rendering of the Services. The detailed provisions for acceptance and review of the claims are always available on the FINTHESIS's website.\n\n3.1.7. perform other actions according to the provisions of the Agreement.\n\n3.1.8. services for making Reimbursements, initiated by the Merchant in favour of Remittees through the Payment Gateway;\n\n3.2. The signing of this Agreement, Merchant confirms, that the Merchant has become familiarized with the general Terms and Conditions, posted at: https://paio.company/ which are an integral part of this Agreement.\n\n3.3. Annexes to this Agreement contain conditions clarifying and complement the agreement and have an integral part of this. In case of a controversy between the terms of the Agreement and the terms of the Annexes, the terms of the Annexes shall prevail.\n\n---\n\n## 4. THE ORDER OF INTERACTION BETWEEN THE PARTIES AND THE ORDER OF MUTUAL SETTLEMENTS\n\n4.1. Within 5 (five) business days from the date of conclusion of the Agreement, FINTHESIS undertakes to create and provide the Merchant with a general list of Payment acceptance methods available to the Merchant and Reimbursement methods in the Payment Gateway.\n\n4.2. Within 5 (five) business days from the date of receipt of the list, the Merchant undertakes to approve the general list of Payment acceptance methods and Reimbursement methods, available to the Merchant by sending a corresponding message to the e-mail: contact@paio.company\n\n4.3. Within 5 (five) business days from the date of approval of the general list of Payment acceptance methods and Reimbursements methods, available to the Merchant, FINTHESIS provides access to the Payment Gateway's information technology services for the duration of the Agreement, and the Merchant connects its Online store to the Payment Gateway. As a result of activation, the Merchant is provided with a Merchant account with Backoffice, where the Merchant gets access to the information technology capabilities of the Payment Gateway.\n\n4.4. The Parties undertake to arrange for a test environment testing the correctness of the Payment Gateway's operations. The test environment is limited to conducting test transactions in amount not exceeding 100 (one hundred) euros, under the condition the size of one transaction cannot be less than 10 (ten) euros, unless other limitations are set by the FINTHESIS. Based on the results of the test transactions, the Merchant undertakes to refund the test transactions within 5 (five) business days from the date of the last test transaction. Exceeding the maximum amount of test payments or failure to refund payments without prior notification to FINTHESIS will be deemed as the beginning of the provision of services to the Merchant by the FINTHESIS in the manner and on the terms and conditions specified herein.\n\n4.5. FINTHESIS has the right to withhold Rolling Reserve in the amount of 10% from each operation for accepting Payments and making Reimbursements for a period of up to 180 (one hundred and eighty) days from each operation for accepting Payments and making Reimbursements) days from the date of the transaction for accepting Payments and making Reimbursements as a Rolling Reserve to ensure that the Merchant fulfils its obligations to reimburse Cardholders the monies on Operations for reimbursements of the Refund or Claim payment (Chargeback). On the next date after 180 (one hundred and eighty) days period the Rolling Reserve shall be released to the Merchant.\n\n4.6. In case of violation of the terms of this Agreement by the Merchant, the occurrence of a Refund or Claim payment (Chargeback) and / or issuance by ICO, by the Acquirer, by Settlement Bank, by the Bank of England, by Financial Conduct Authority, by judicial/law enforcement agencies and/or other authorized governmental bodies of claims, fines, fees, damages and other sanctions, related to violation by the Merchant of the requirements of the current legislation and / or the terms of this Agreement, the FINTHESIS has the right to withhold from the Rolling reserve the amount of money, equal to the amount of Refund or Claim payments (Chargeback) and / or claims, fines, penalties and other sanctions under the Agreement, issued by International payment system (IPS), by the Acquirer, by Settlement Bank, by the Bank of England, by Financial Conduct Authority, by judicial/law enforcement agencies and/or other authorized governmental bodies, with notifying the Merchant in writing of such withholding with the attachment of documents, confirming the amount of the withheld amount of money, as well as the basis and eligibility for withholding the amount of money no later than 3 (three) working days from the date of withholding the amount of money. If withholding is not possible in full amount due to insufficiency of the funds, FINTHESIS has right to issue an invoice to be paid by the Merchant within 10 (ten) business days. If the Merchant does not settle such invoice in a timely manner, the FINTHESIS has the right to refuse wire transfer for the Transactions to the Merchant until full settlement of the invoice.\n\n4.7. FINTHESIS transfers funds for accepted Payments to the Merchant's settlement account, specified in section 16 of the Agreement (Details of the parties), within the terms and conditions, specified in Annex No. 2 to this Agreement. Merchant in writing form can ask the FINTHESIS to transfer settlement to other account, which is not specified in the Annex No.2. In this case, FINTHESIS is not responsible for business and contractual relationships between Merchant and third-party recipient account.\n\n4.8. Reimbursement operations are executed at the expense of the Merchant's balance in the Payment Gateway, which is replenished by the Merchant by transferring funds to the FINTHESIS's transit account specified in section 16 of the Agreement (Details of the parties).\n\n4.9. The cost of services for accepting Payments and making Reimbursements is determined depending on the methods of making Reimbursements and is specified in Annex No. 2 of the Agreement. The cost of services for each transaction of accepting Payments and making Reimbursements is withheld by the FINTHESIS independently.\n\n4.10. FINTHESIS records the deduction of the cost of services rendered (clause 4.9. of the Agreement), specifying it in the Registers of accepted payments and in the Reimbursements register, data on which are available in the Personal account of the Merchant.\n\n4.11. FINTHESIS's fees exclude all Taxes. Merchant has sole responsibility and liability for:\n\n4.11.1. determining which, if any, Taxes or fees apply to the sale of Merchant's products and services, acceptance of donations, or payments Merchant makes or receives in connection with Merchant use of the FINTHESIS Services;\n\n4.11.2. assessing, collecting, reporting, remitting Taxes for Merchant's business. If FINTHESIS is required to withhold any Taxes, FINTHESIS may deduct those Taxes from amounts otherwise owed to the Merchant and pay those Taxes to the appropriate taxing authority. If the Merchant is exempt from paying or otherwise eligible to pay a reduced rate on, those Taxes, Merchant may provide to FINTHESIS an original certificate that satisfies applicable legal requirements attesting to your tax-exempt status or reduced rate eligibility, in which case FINTHESIS will not deduct the Taxes covered by the certificate. Merchant must provide accurate information regarding tax affairs as FINTHESIS reasonably requests and must promptly notify FINTHESIS if any information that FINTHESIS prepopulates is inaccurate or incomplete. FINTHESIS may send documents to Merchant and taxing authorities for transactions processed using the FINTHESIS Services. Specifically, Law may require FINTHESIS to file periodic informational returns with taxing authorities related to Merchant use of the FINTHESIS Services. FINTHESIS may send tax related information electronically to Merchant.\n\n4.12. The Parties are paying income tax and/or any similar tax independently in accordance with legislation of their countries.\n\n4.13. If FINTHESIS is required to account and pay VAT or another tax of this nature for its services, this tax shall not be included in the tariffs and shall be applied in addition to the fees.\n\n4.14. If FINTHESIS has to pay any tax or fee in the country of the Merchant. The Merchant shall compensate the FINTHESIS for the amount of such tax within 10 (ten) working days from the date of receipt of the relevant request of the FINTHESIS.\n\n---\n\n## 5. THE RIGHTS AND OBLIGATIONS OF THE PARTIES\n\n### 5.1. FINTHESIS undertakes:\n\n5.1.1. to provide the Merchant with the services via Payment Gateway which includes:\n\n5.1.1.1. connect the Merchant to the Payment Gateway and assignment of terminals for processing of Transactions;\n\n5.1.1.2. facilitate collection of Card details from the Cardholders;\n\n5.1.1.3. process Authorisation requests and responses under Rules set forth by the ICO;\n\n5.1.1.4. notify the Merchant of the Authorisation response, incl. Successful Authorisation (in the event of a failed or declined Authorisation the Merchant shall immediately receive an electronic notice of such Authorisation);\n\n5.1.2. receive the Transaction Amounts from the ICO or other Acquirer or Payment facilitator.\n\n5.1.3. FINTHESIS shall deduct the amounts due from the Merchant, as well as any applicable fees and charges set out in the Agreement and its Annexes, from the Transaction Amounts as follows (in such order that FINTHESIS deems appropriate):\n\n5.1.3.1. The amount of Rolling reserve calculated from the Card Payments processed within the Accounting Period, unless the Parties have agreed otherwise in written form.\n\n5.1.3.2. all fees and charges applicable to the Transactions processed within the Accounting Period.\n\n5.1.3.3. Refunds, Chargebacks accrued and/or received by the current time notwithstanding the Accounting Period.\n\n5.1.3.4. fees and charges applicable for Refunds, Chargebacks, Retrieval Requests or any other charges relating to the dispute resolution process at the current time notwithstanding the Accounting Period.\n\n5.1.3.5. proven penalties, proven fines, fees applicable, proven direct losses, expenditures at the current time notwithstanding the Accounting Period.\n\n5.1.4. When making the transfers described in sub clauses 5.1.2.-5.1.3 above, FINTHESIS shall act as a payment agent and shall execute transfers within the execution time specified under the Agreement, but shall not be liable for any delays caused by, or resulting from, the late or otherwise incorrect receipt of the Transaction Amounts from the ICO and / or any correspondent bank and / or Issuer. FINTHESIS shall not be liable for any delays in transfer of Transaction Amounts, if the delays are caused by any restrictions imposed on or by the ICO or other Acquirer or Payment facilitator, or any correspondent bank. FINTHESIS shall not be liable to transfer any Transaction Amount to the Merchant, if such Transaction Amount was not received from an ICO.\n\n5.1.5. If for any reason the amount received by FINTHESIS from the ICO or other Acquirer or Payment facilitator, is less than the total of the processed Transaction Amounts, FINTHESIS shall transfer the amounts actually received to the Merchant after making the applicable deductions in accordance with Clause 5.1.3.\n\n5.1.6. No later than 5 (five) business days from the date of the Agreement conclusion, to ensure the appropriate Payment Gateway settings, as well as round-the-clock (24X7) operation of the System in order to receive Payments from Cardholders and make Reimbursements and exchange information messages between the Payment Gateway and the Merchant.\n\n5.1.7. To send to the Merchant an electronic confirmation of the accepted Payment (System Message), indicating a unique Payment number, which can be used to clearly identify the Payment details.\n\n5.1.8. To notify the Merchant about the temporary interruption of services no later than the date of such temporary interruption, indicating the reason and duration of the temporary interruption.\n\n5.1.9. To fulfil technical support of the Payment Gateway in accordance with the terms of the section 8 of the Agreement.\n\n5.1.10. To generate report of accepted payments and Reimbursement payments report for each day and provide it to the Merchant on the website: https://portal.paymentz.co.uk/login. If there are no Transfers, the FINTHESIS sends a report with a zero value to the Merchant. If the report is corrected, FINTHESIS sends the corrected report to the Merchant (excluding Transfers, not accepted by the Merchant) no later than 14:00 (GMT) on the day the report is transferred to the Merchant. Monthly Payment reports are generated based on the sent transfer reports. FINTHESIS shall not change data in the sent reports unilaterally.\n\n5.1.11. To comply with the requirements of the current legislation of England and Wales: including: (a) EU Regulation 2016/679 (GDPR); (b) GDPR as it forms part of the law of England and Wales by virtue of section 3 of the European Union (Withdrawal) Act 2018 (the UK GDP); (c) (in the UK) the Data Protection Act 2018 (DPA); (d) EU Directives 95/46/EC and 2002/58/EC (as amended by 2009/136/EC) and any legislation implementing or made pursuant to such directives, including (in the UK) the Privacy and Electronic Communications (EC Directive) Regulations 2003; (e) the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017 including amendments; (f) Bribery Act (2010); and (g) any laws or regulations ratifying, implementing, adopting, supplementing or replacing the forgoing; in each case, to the extent in force, and as such are updated, amended or replaced from time to time., including measures to conduct proper verification of the Payers (conduct identification of the payer), check on sanctions lists, and exclude the possibility of using payments as a facility for legalizing (laundering) proceeds from crime and financing terrorism.\n\n5.1.12. If any Payments are considered as incorrect, duplicated, or confirmed as fraudulent transactions after they are included in the summary report, FINTHESIS is required to cancel such Payments.\n\n### 5.2. FINTHESIS has the right:\n\n5.2.1. To conclude all necessary agreements with the ICO, Acquirer and/or Payment facilitator at its own discretion and process the Card and Transaction data in accordance with this Agreement and provisions of agreement entered into with the ICO, Acquirer and/or Payment facilitator.\n\n5.2.2. Temporarily, unilaterally, with mandatory prior notification of the Merchant specifying the reasons, to interrupt the execution of obligations under the Agreement in the following cases:\n\n5.2.2.1. If circumstances arise that hinder in use of any hardware and software tools, connected to the technical infrastructure of the Merchant, or specialized software for the duration of such circumstances;\n\n5.2.2.2. The occurrence of circumstances beyond the control of the Parties, that in the opinion of the FINTHESIS, should cause significant losses for the FINTHESIS and/or the Merchant for the duration of such circumstances;\n\n5.2.2.3. Violation by the Merchant of any of its obligations, specified in the Agreement, until the Merchant completely eliminates the violation.\n\n5.2.3. Withhold all its expenses unilaterally from the funds which shall be transferred to the Merchant for Transactions performed at the E-shop, including Fees and charges of the FINTHESIS, ICO and/or Acquirer's or Payment facilitator's commissions for the wire transfer as well as all fines imposed on the FINTHESIS by the ICOs and/ or Acquirer;\n\n5.2.4. If withholding is not possible in full amount due to insufficiency of the funds, FINTHESIS has right to issue an invoice to be paid by the Merchant within 10 (ten) business days. If the Merchant does not settle such invoice in a timely manner, the PAYMENT has the right to refuse wire transfer for the Transactions to the Merchant until full settlement of the invoice.\n\n5.2.5. Request information about received Chargebacks, including Prove of purchase and any other documents supporting a Transaction, and other data from the Merchant in accordance with the ICO Rules.\n\n5.2.6. To require the Merchant to conduct interim reconciliations of settlements under the Agreement in case of discrepancies.\n\n5.2.7. To post information about cooperation with the Merchant, as well as trademarks or other images that are the means of identifying the Merchant and/or its services in relevant printed materials and on Internet websites, used by the FINTHESIS to accept Payments from Cardholders.\n\n5.2.8. FINTHESIS has the right to transfer part of its rights and powers to third parties in order to fulfill its obligations under this Agreement. The transfer of its rights and powers under this Agreement by the FINTHESIS does not release the FINTHESIS from fulfilling its obligations under it and does not relieve the FINTHESIS of responsibility for violating its obligations under this Agreement.\n\n5.2.9. FINTHESIS has the right to require the Merchant (it's representative) to provide information and documents necessary for proper verification and identification of the Merchant (its representative), identification of the beneficial owner, as well as providing information on tax residence, type of activity and source of financing of operations performed, documents related to operations.\n\n5.2.10. In case of receiving a request for additional information on Payments from the Acquirer, the Bank of England, the Financial Conduct Authority, and/or any other state bodies, or as part of the analysis of operations of the Merchant and Cardholders, the FINTHESIS entitled to provide the available information, data, and documents on operations without prior notice of Merchant.\n\n5.2.11. The FINTHESIS has the right to refuse the Merchant to conduct operations for accepting Payments and making Reimbursements and / or temporarily interrupt operations of the Merchant in cases provided by the Applicable Law and ICO Rules.\n\n### 5.3. The Merchant undertakes:\n\n5.3.1. To comply with all applicable legal and technical requirements and rules set by FINTHESIS, when working with the Payment Gateway.\n\n5.3.2. To indicate accurately and reliably all information, required for accepting Payments and making Reimbursements (including, but not limited to, last name, first name, passport data for individuals).\n\n5.3.3. To do not use the System in any business activities that violate the Applicable law and ICO Rules.\n\n5.3.4. To pay independently all taxes, related to activities.\n\n5.3.5. To resolve claims of Cardholders independently.\n\n5.3.6. At the request of the FINTHESIS provide information on the Merchant's activities and documents necessary for the FINTHESIS to fulfill its obligations under the Agreement and the Applicable law and internal documents of the FINTHESIS, including, but not limited to, information on beneficial owners within 3 (three) business days from the date of receipt of the request.\n\n5.3.7. To reimburse the FINTHESIS for losses, incurred related to fines and other deductions, caused by the Merchant's violation of the ICO Rules, as well as expenses, indicating the violation of the ICO Rules, which resulted in fines and other deductions; In order to prevent the possibility of causing losses to the FINTHESIS, to notify the FINTHESIS in writing within 3 (three) business days of the receiving decisions/actions by the authorized bodies of a restrictive nature in relation to the Merchant, such as:\n\n5.3.7.1. forced reorganization or liquidation of the Merchant;\n\n5.3.7.2. temporary interruption of expense transactions on any bank accounts of the Merchant\n\n5.3.7.3. distrainment of monetary means and / or other assets of the Merchant;\n\n5.3.7.4. other decisions or actions in accordance with the Applicable law.\n\n5.3.8. To notify the FINTHESIS in writing regarding all amendments in the documents, submitted at the conclusion of this Agreement, as well as changing the management, phone numbers, e-mail, legal/physical addresses, bank details, foundation documents, and other information, which were provided by the Merchant to the FINTHESIS, within 5 (five) business days from the date of such amendments.\n\n5.3.9. To inform the FINTHESIS immediately about cases of data compromise (or Merchant's suspicion of compromise) of information about card details and Payments, made using them through the Payment Gateway of FINTHESIS, that have become known to the Merchant.\n\n5.3.10. The Merchant undertakes to pay any fines and claims, incurred by the Acquirer or the ICO in full and as per terms of this Agreement. If the Merchant does not pay such a fine, the FINTHESIS has the right to interrupt all payments, and the Merchant allows the FINTHESIS to pay penalties independently the expense of the Merchant from the available funds on the Merchant's balance.\n\n5.3.11. Use the 3D Secure solution and SSL (Secure Sockets Layer) data transmission protocol (no less than 128 bits) for receipt and transfer of the Transaction Data on the Internet.\n\n5.3.12. Return to the Cardholder the Transaction amount wholly or partly in accordance with Transaction cancellation rules of the Merchant in case the Cardholder opts out of purchased item/service, or if the Merchant does not supply the goods or does not render the services as appropriate.\n\n5.3.13. Inform FINTHESIS immediately about established fraudulent activities with the Cards related to the performance of the Agreement.\n\n5.3.14. Perform a regular check for conformity to the PCI DSS rules and present a certified copy of valid PCI DSS certificate or Self-Assessment Questionnaire estimation to FINTHESIS within 10 (ten) days after sending of corresponding request of FINTHESIS in case FINTHESIS's software providing an integration into the Gateway is not used by the Merchant. The Merchant is obliged not to allow the situation when obligations provided in the Agreement are performed without valid PCI DSS certificate or Self-Assessment Questionnaire.\n\n5.3.15. Comply with the Agreement and regulations of the ICOs. Full and detailed ICO Rules are available on the official web sites of the particular ICO.\n\n### 5.4. The Merchant has the right:\n\n5.4.1. To use the Payment Gateway and its Services in any accessible and non-prohibited way.\n\n5.4.2. To access the Payment Gateway in any convenient way allowed by the System.\n\n5.4.3. To place FINTHESIS logo and the corresponding hypertext link to the FINTHESIS's website (and/or the Payment System's website, if required) on the website of the Online Store, describing the conditions for making Payments through the Payment Gateway, to which the Cardholders should have access.\n\n5.4.4. To require the FINTHESIS (its representative) to provide information and documents necessary for proper verification and identification of the FINTHESIS (its representative), identification of the beneficial owner, as well as information on tax residence, type of activity, and source of financing of operations performed, and documents related to operations.\n\n5.4.5. Submit to FINTHESIS claim on quality of services provided by FINTHESIS (fulfilment of provisions of the Agreement) in the following manner: by e-mail to: info@FINTHESIS.co.uk, OR orally via phone number +447308698161.\n\n5.4.6. In the claim the Merchant should indicate following minimum of required information:\n\n5.4.6.1. Merchant's name, registration number, registration address and country, contact e-mail address, whether the Merchant agrees to receive reply to the claim at the above e-mail address;\n\n5.4.6.2. subject of the claim and facts supporting the claim, demands;\n\n5.4.6.3. authorized signature of the Merchant's representative and date of signing the claim (if submitted in written document form);\n\n5.4.6.4. copies of the documents supporting the claim (if submitted in written document form).\n\n5.4.7. Claim should be in English and Russian (with appropriate accept of FINTHESIS). If the Claim is submitted in oral form, the FINTHESIS may request to prepare and submit it in writing, if it is not possible to satisfy the claim immediately and/ or review of the claim is related to check of various facts.\n\n5.4.8. Period for review of the any claim is 90 (ninety) days from the moment of receipt by FINTHESIS. The Merchant has the right to request from the FINTHESIS information about the progress of claim review.\n\n5.4.9. The Merchant has the right to recall the claim at any time during the period of claim review by FINTHESIS and inform FINTHESIS about it in the e-mail or in written document form.\n\n---\n\n## 6. CHARGEBACK, REFUND TO THE CARDHOLDER\n\n6.1. If FINTHESIS receives Chargeback, FINTHESIS applies with a written request (on paper or in electronic form) to the Merchant to provide Sales draft confirming the fulfilment of obligations to supply goods/works/services to the related Cardholder.\n\n6.2. The Merchant must provide FINTHESIS with the documents requested by FINTHESIS in accordance with the terms of the Agreement, within 5 (five) business days from the date of receipt of such request.\n\n6.3. If the Merchant fails to provide documents, or if the deadline for their submission specified in clause 6.2 of the Agreement is violated, or if the Transaction is indisputably recognized as fraudulent by the Payment System and/or the Acquirer, the Merchant is recognized as agreeing with the fact of non-performance or improper performance of its obligations to the Payer by the Merchant.\n\n6.4. If the Payment System and/or the Bank issues penalties, fines, or sanctions to the FINTHESIS for non fulfilment or improper fulfilment by the Merchant of its obligations to provide documents and refuse to accept fraudulent transactions, the Merchant undertakes to return the Transaction amount to the Cardholder at its own expense. FINTHESIS has the right to deduct the amount consisting of the transaction cost, the FINTHESIS's remuneration, penalties, fines, and sanctions issued by the Payment System and / or the Bank from the funds transferred to the Merchant's account. The Merchant hereby gives its consent for withholding by FINTHESIS the amount of penalties, fines, and sanctions issued by the Payment System and / or the Bank.\n\n6.5. The transfer of funds by FINTHESIS to the Merchant account for Transactions does not mean final and undisputed recognition of the sanctity of such Transactions. Such Transactions may be deemed unauthorised in accordance with the Applicable law, the Agreement, and ICO Rules. The Merchant hereby assumes all risks connected with possible recognition of the Transaction as fraudulent and undertakes to unconditionally return the money to FINTHESIS in the event of receiving (or initiating, if the Acquirer is the issuer) Chargeback.\n\n6.6. If the Acquirer and / or the FINTHESIS detect a Transaction, the Authorisation of which raises suspicions of the Acquirer and / or the FINTHESIS, the FINTHESIS has the right to temporarily interrupt the Payments for goods / works / services in the Merchant's Online store with using of cards through the FINTHESIS's System and crediting of funds to the FINTHESIS's account under such Transactions. The temporary interruption of the transfer of funds carried out for the period of investigation of the Authorisation of the Transactions, but not more than 180 (one hundred and eighty) days from the date of the Transaction.\n\n---\n\n## 7. LIABILITY OF THE PARTIES\n\n7.1. Merchant acknowledges and agrees that the failure to pay any amounts within thirty (30) days of the due date will constitute a material breach of this Agreement.\n\n7.2. In case of insufficient funds withheld as a Rolling Reserve for repayment of claims, fines, penalties, and other sanctions related to the violation of the requirements by the ICO, Acquirer, Settlement bank, the Bank of England, the Financial Conduct Authority, judicial/law enforcement agencies, and/or other authorized bodies according to the current legislation and/or the terms of this Agreement, the FINTHESIS has the right to suspend the acceptance of Payments in favor of the Merchant, as well as within the framework of Payments, initiated by the Merchant in favor of the Remittee of the transfer, as well as withhold any funds of the Merchant that are in all accounts of the Merchant opened in the FINTHESIS and the Merchant gives its full and irrevocable consent.\n\n7.3. The Merchant is fully responsible to the FINTHESIS for the actions of persons who have access to the management of the Online Store, the Merchant's website, in relation to Payments made through the FINTHESIS's Payment Gateway in violation of the requirements of the Agreement, as well as for actions directed against the FINTHESIS and/or Payers.\n\n7.4. The FINTHESIS is fully responsible to the Merchant for the actions of persons who have access to the Payment Gateway management in relation to Payments made through the FINTHESIS's Payment Gateway in violation of the requirements of the Agreement, as well as for actions directed against the Merchant and/or Payers.\n\n7.5. The Merchant is fully liable for direct damages caused to third parties as a result of its failure to comply with the requirements of Applicable law in the implementation of its activities, including the implementation of activities through the FINTHESIS's Payment Gateway.\n\n7.6. FINTHESIS is fully liable for damage caused to third parties, the Merchant as a result of non-compliance with the requirements of the Applicable law in the implementation of its activities, including the implementation of activities through its FINTHESIS Payment Gateway.\n\n7.7. FINTHESIS is not responsible in case of disagreements and disputes between the Merchant and the Payer in relation to the goods/ works/ services sold by the Merchant.\n\n7.8. FINTHESIS is not responsible for violations in the operation of technical means, software, power supply systems, and data transmission that occurred through no fault of FINTHESIS.\n\n7.9. FINTHESIS is not responsible for the content of the information provided by the Merchant for placement on the information materials and resources of the Merchant and payment services.\n\n7.10. In the event that FINTHESIS has any losses due to the actions or omissions of the Merchant in connection with the statements made by the Payers due to the failure of the Merchant to fulfil its obligations to the Payers, the Merchant undertakes to compensate in full the direct damages of any kind caused to FINTHESIS.\n\n7.11. To the extent permitted by the Applicable law, the liability of FINTHESIS is limited to the amount of actual damage caused to the Merchant. Neither Party is not liable to the other Party for loss of profit, loss of income, loss or inability to obtain expected savings, lost profits, or for any other indirect or indirect loss or damage.\n\n7.12. The Parties are responsible for the disclosure or loss of confidential information specified in Section 9 of the Agreement, in accordance with Applicable law.\n\n7.13. The FINTHESIS is not responsible for the delay in the transfer of the cost of services to the Merchant if such a delay is caused by an untimely written notification to the FINTHESIS about the change in the Merchant's details specified by the Merchant in Section 16 of this Agreement, as well as if the FINTHESIS violates the terms of this Agreement.\n\n7.14. The FINTHESIS is not responsible for disputes and disagreements between the Merchant and the Payers on Payments made using Cards through the Merchant's Online Store, related to failures in the operation of the software and electronic communication channels used by the Merchant during the above-mentioned Payments, as well as in situations related to the Merchant's provision of information protection during these Payments, and in other situations caused by the Merchant's fault.\n\n7.15. The Merchant is obliged to compensate the FINTHESIS for any direct losses incurred by it, if such losses were related to the sale of goods/works/services of the Merchant prohibited for sale by the Applicable law and prohibited for sale via the Internet in accordance with the Rules of International Payment Systems.\n\n7.16. In the event of a breach by the Merchant of the obligation specified in clause 4.3.7 of the Agreement, to compensate direct losses of the FINTHESIS, within 3 (three) working days from the date of receipt of the relevant claim, while the FINTHESIS reserves the right to terminate the Agreement unilaterally.\n\n7.17. If the actions of the Merchant's personnel cause losses (including actual damage), the Merchant will compensate the FINTHESIS for the losses / damage caused, the amount of which is indicated in the written claim submitted by the FINTHESIS and can be adjusted by an agreement signed by both Parties. The FINTHESIS and the Merchant in each individual case specify the procedure for compensation by the Merchant of the FINTHESIS for losses and / or damage to the business reputation of the FINTHESIS – withholding from the amounts due to the Merchant or payment on the invoice issued by the FINTHESIS. The FINTHESIS has the right to suspend settlements under the Agreement until the settlement of the claims provided for in this clause of the Agreement.\n\n7.18. Neither Party shall not be liable to the other Party for:\n\n7.18.1. any business interruption, loss of profits, loss of business, loss of revenue, loss of goodwill, loss of opportunity, loss or injury to reputation or loss of anticipated savings arising from or in connection with the Agreement, even if Party was made aware of a possibility that such loss or damage could occur; or\n\n7.18.2. any indirect or consequential loss or damage which may arise from or in connection with the FINTHESIS's performance, purported performance its obligations under the Agreement; or\n\n7.18.3. any loss or damage of a type which was not reasonably foreseeable when the Agreement was concluded, whether or not the possibility of that type of loss or damage was subsequently advised to or otherwise became known, or should have become known, to Party after the date of the Agreement; or\n\n7.18.4. any claim where the circumstances giving rise to a claim:\n\n7.18.4.1. are due to an unusual and unforeseeable event, outside FINTHESIS's reasonable control and the consequences of which could not have been avoided even if all due care had been exercised (force majeure, such as, for example, events of war and acts of God, strike, lockout, traffic disruption, acts of domestic or foreign governmental authorities); or\n\n7.18.4.2. were caused by FINTHESIS's compliance with applicable laws and regulations; or\n\n7.18.4.3. any loss or damage to the extent that the Merchant contributed to that loss or damage by any action or omission (whether negligent or not) and the Merchant's liability in that instance shall be determined in accordance with the principles of contributing negligence; or\n\n7.18.4.4. the action or inaction of any intermediary service provider appointed by FINTHESIS, and the FINTHESIS's liability in such instance shall be limited to using reasonable care in the selection, appointment and instruction of such intermediary service provider; or\n\n7.18.5. any delay or shortfall in the receipt of funds from the International Card Schemes, as well as for non-receipt of such funds given that FINTHESIS has processed Transactions in accordance with the applicable ICO Rules;\n\n7.18.6. any failure or disruption in the technical infrastructure which the Merchant uses if such failure or disruption is due to abnormal and unforeseen circumstances beyond the FINTHESIS's control;\n\n7.19. FINTHESIS will not be liable to the Merchant if FINTHESIS executes a Transaction in accordance with a unique identifier (Card number or other) provided by the payer, but where the unique identifier provided was incorrect. Such transactions shall be deemed to be correctly executed by FINTHESIS and shall not be construed as unexecuted or incorrectly executed payment transactions for which FINTHESIS may have liability. However, FINTHESIS will make reasonable efforts to recover the funds involved in the payment transaction and the Merchant agrees that FINTHESIS may charge the Merchant for its actual costs in attempting any such recovery.\n\n---\n\n## 8. SYSTEM TECHNICAL SUPPORT\n\n8.1. FINTHESIS provides the Merchant with a technical support for the entire period of this Agreement.\n\n8.2. The Merchant shall describe an issue and send the application to FINTHESIS's email address: contact@paio.company\n\n8.3. Within 24 hours from the date of receipt of the application, FINTHESIS undertakes to send the Merchant a notification by e-mail about the acceptance of the application for execution and the terms of the decision.\n\n8.4. Technical support does not include training of the Merchant's employees in the use of the Payment Gateway.\n\n---\n\n## 9. CONFIDENTIALITY\n\n9.1. With the exception of the cases stipulated in this Agreement, the Parties undertake not to disclose the information received during the performance of the Agreement, which is confidential for each of the Parties. Confidential information in the Agreement means information that is not publicly available, the disclosure of which may lead to losses and / or affect the business reputation of any of the Parties, including information about Cardholders, Transactions, payments, Reimbursements, information about the tariff and pricing policies of the Parties.\n\n9.2. The fact of the conclusion of the Agreement and the subject of the Agreement are not confidential information.\n\n9.3. The Parties undertake not to disclose to third parties the information specified in clause 9.1 of the Agreement, except for the responsible persons and partners of the Parties authorized to receive and transmit information on behalf of each of the Parties in connection with the performance of obligations under the Agreement.\n\n9.4. Confidential information may be provided to third parties only in accordance with the procedure established by the Applicable law, to the partners of the FINTHESIS and its agents solely for the purpose of fulfilling the terms of the Agreement or by prior written agreement with the Party whose information may be disclosed (with a detailed indication of the nature of the information, indication of the third party, goals, reasons and other significant points concerning such information).\n\n9.5. In the event of termination of the Agreement, the Parties undertake not to disclose or use for their own benefit and/or the interests of third parties the information specified in clause 9.1 of the Agreement within 1 (one) year from the date of termination of the Agreement.\n\n---\n\n## 10. FORCE MAJEURE\n\n10.1. The Parties shall not be liable for non performance or improper performance of obligations under the Agreement, if such non-performance was the result of force majeure (fire, flood, earthquake, etc.), intentional actions of third parties, changes in current legislation, as well as decisions of state bodies, provided that these circumstances did not depend on the will of the Parties and made it impossible for any of the Parties to fulfil their obligations under the Agreement.\n\n10.2. The term of performance of obligations under the Agreement is postponed in proportion to the time during which the force majeure circumstances were in effect.\n\n10.3. In case the occurrence and termination of force majeure circumstances, one of the Parties, for which the breach of the obligation was the result of the occurrence of force majeure circumstances, is obliged to notify the other Party in writing within 10 (ten) days from the date of the occurrence/ termination of force majeure circumstances.\n\n10.4. The documents issued by the competent authorities serve as evidence of the presence and duration of force majeure circumstances.\n\n10.5. Failure to notify or late notification deprives the Party of the right to refer to any of the above circumstances.\n\n10.6. If the non-performance or improper performance of obligations under the Agreement in accordance with clause 10.1. lasts more than 2 (two) months, each Party has the right to terminate the Agreement unilaterally, notifying the other Party no later than 10 (ten) days before the expected date of termination of the Agreement.\n\n---\n\n## 11. SUSPENSION OF THE SERVICES\n\n11.1. FINTHESIS shall be entitled to suspend, with immediate effect, the acceptance of Cards, the use of the Merchant Account, the processing of any Transactions and the transfer of the Transaction Amounts until all the circumstances are clarified to FINTHESIS's satisfaction if FINTHESIS suspects:\n\n11.1.1. that the Transactions relate to money laundering or financing of terrorism or proliferation;\n\n11.1.2. that any unauthorised third person has gained access to the Payment Gateway (incl. when the Merchant has notified FINTHESIS of such suspicion);\n\n11.1.3. that the Merchant uses FINTHESIS's Services at an unregistered Online Store. In each case FINTHESIS shall have absolute discretion with regards to when to resume accepting Cards, operating the Merchant Account, processing Transactions and transferring the Transaction Amounts, taking into account the available information and any recommendations of the International Card Schemes;\n\n11.2. FINTHESIS shall be entitled to suspend, with immediate effect, the acceptance of Cards, the use of the Merchant account Payment Gateway's Backoffice, the processing of Transactions and transfers of the Transaction Amounts until all the circumstances are clarified to FINTHESIS's satisfaction if the Merchant breaches:\n\n11.2.1. the Agreement; and/or\n\n11.2.2. the ICO Rules. FINTHESIS shall have absolute discretion following such a suspension as to when to resume accepting Cards, operating the Merchant Account, processing Transactions and transferring the Transaction Amounts, taking into account the available information and any recommendations of the ICO;\n\n11.3. FINTHESIS shall be entitled to suspend the provision of any services under this Agreement:\n\n11.3.1. if the ICO Rules are subsequently amended in such a way that, in the reasonable opinion of FINTHESIS, makes the continued provision of services under this Agreement impracticable or economically unviable; and/or\n\n11.3.2. if the Merchant is suspected of breaking the Rules of International Card Schemes;\n\n11.3.3. if the Merchant exceeds any limit or threshold mentioned in the Annex No.2 Tariffs and conditions.\n\n11.4. To the extent permitted by applicable laws and regulations, FINTHESIS shall notify the Merchant without undue delay of exercising its rights under Clause 11.1.1- 11.1.3, 11.2.1. and 11.3.1.-11.3.3. If the grounds for exercising those rights no longer exist, FINTHESIS shall notify the Merchant without undue delay after learning this and shall resume the normal provision of services\n\n---\n\n## 12. TERM OF VALIDITY AND PROCEDURE FOR TERMINATION AND AMENDMENT OF THE AGREEMENT\n\n12.1. The Agreement comes into force from the date of its signing by both Parties and is valid indefinitely.\n\n12.2. The Agreement may be terminated at any time, at the initiative of either Party, with prior notice to the other Party 60 (sixty) days prior to the expected date of termination and subject to mutual settlements by the Parties. The Parties shall reconcile the settlements and repay the monetary obligations identified as a result of the reconciliation within no more than 30 (thirty) days from the date of receipt of the Notice of Termination of the Agreement (except for the cases stipulated in this Agreement), after which the Agreement is considered terminated.\n\n12.3. At the request of the Merchant, the Agreement may be suspended for a period not exceeding 10 (ten) days. The basis for the suspension of the Agreement is the written consent of the FINTHESIS to the request of the Merchant, which contains the terms of the suspension and the procedure for the renewal of the Agreement.\n\n12.4. The Agreement may be terminated unilaterally at the initiative of FINTHESIS without observing the terms stipulated in clause 12.2. of the Agreement in the event of refusal of the services by an Acquirers and/or payment facilitator, regardless of the reason for such refusal.\n\n12.5. The Agreement may be terminated unilaterally at the initiative of FINTHESIS without observing the terms provided for in clause 12.2 of the Agreement, in case of violation of the clauses provided for in clause 4.3 of this Agreement.\n\n12.6. The Agreement may be terminated unilaterally at the initiative of the FINTHESIS without observing the terms provided for in clause 12.2. of the Agreement, if, in the course of studying the operations performed by the Merchant, suspicions arise that the business relations under this Agreement are used by the Merchant for the purpose of legalizing (laundering) proceeds from crime or financing terrorism.\n\n12.7. The Agreement may be terminated unilaterally at the initiative of the Merchant without observing the terms provided for in clause 12.2 of the Agreement, in case of violation by the FINTHESIS of the obligations provided for in clause 4.1 of the Agreement.\n\n12.8. In the event of unilateral termination of the Agreement, the Initiator Party shall send a Notice of termination of the Agreement in writing by mail with a notification of delivery or by courier. The Agreement is considered to be terminated from the moment of receipt of such notification by the other Party.\n\n12.9. In case of unilateral termination of the Agreement, FINTHESIS disconnects the Merchant from the Payment Gateway on the day of delivery of the Notice of Termination of the Agreement to the Party.\n\n---\n\n## 13. CONSEQUENCES OF TERMINATION OF THE AGREEMENT\n\n13.1. The obligations to accept Payments and make Reimbursements by FINTHESIS in favor of the Merchant are terminated upon termination or suspension of the Agreement.\n\n13.2. If the reason for the termination of the Agreement was a material violation of one of the Parties, the other Party has the right to claim compensation for the actual damage caused, if there are supporting documents.\n\n13.3. The monetary obligations of the Parties, as well as the obligations that determine the liability of the Parties for breach of the Agreement, remain in force until their full execution.\n\n---\n\n## 14. REPRESENTATIONS AND WARRANTIES\n\n14.1. The Merchant represents and warrants to FINTHESIS as follows:\n\n(i) the Merchant is duly organized, validly existing and in good standing under the Applicable law, has the power to transact the business in which it is now engaged and is duly qualified and in good standing under the laws of each jurisdiction where the conduct of its business requires such qualification, except for failures to be so qualified, authorized or licensed that could not in the aggregate have a material adverse effect on the business operations, assets or financial condition of the Merchant and its subsidiaries, taken as a whole. The Merchant does not do business under any fictitious business name;\n\n(ii) the Merchant has the power and authority to execute, deliver and perform this Agreement and all obligations required and have taken all necessary actions to authorize this Agreement and the execution, delivery and performance of this Agreement and all obligations required. Except as shall have been obtained, no consent of any other person including, without limitation, stockholders and creditors of the Merchant, and no license, permit, approval or Authorisation of, exemption by, notice or report to, or registration, filing or declaration with, any governmental authority is required by the Merchant in connection with this Agreement or the execution, delivery, performance, validity or enforceability of this Agreement and all obligations required. This Agreement has been, and each instrument or document required will be, executed and delivered by a duly authorized officer of the Merchant, and this Agreement constitutes, and each instrument or document required when executed and delivered hereunder will constitute, the legally valid and binding obligation of the Merchant enforceable against the Merchant in accordance with its terms;\n\n(iii) the execution, delivery and performance of this Agreement and the documents or instruments required will not violate any provision of any existing law or regulation binding on the Merchant, or any order, judgment, award or decree of any court, arbitrator or governmental authority binding on the Merchant, or the governing instruments of, or any securities issued by, the Merchant or of any mortgage, indenture, lease, contract or other Agreement, instrument or undertaking to which the Merchant is a party or by which the Merchant or any of its assets may be bound, the violation of which would have a material adverse effect on the business operations, assets or financial condition of the Merchant and its subsidiaries, taken as a whole, and will not result in, or require, the creation or imposition of any lien on any of its property, assets or revenues pursuant to the provisions of any such mortgage, indenture, lease, contract or other agreement, instrument or undertakings.\n\n14.2. The Merchant warrants that it shall perform the Agreement and providing services to Payers with a standard of care, skill and diligence maintained by persons providing, on a commercial basis, services similar to the Merchant's services.\n\n14.3. The Merchant ensures that all persons employed or retained to perform the Agreement are qualified and competent to perform them and are properly trained, instructed, and supervised.\n\n---\n\n## 15. APPLICABLE LAW AND DISPUTE RESOLUTION PROCEDURE\n\n15.1. This Agreement and any dispute or claim arising out of or in connection with it or its subject matter or formation (including non-contractual disputes or claims) shall be governed by and construed in accordance with the law of England and Wales.\n\n15.2. Each party irrevocably agrees that the courts of England and Wales shall have exclusive jurisdiction to settle any dispute or claim arising out of or in connection with this agreement or its subject matter or formation (including non-contractual disputes or claims).\n\n---\n\n## 16. MISCELLANEOUS\n\n16.1. **Independent Parties.** FINTHESIS and Merchant are independent parties. Nothing in this Agreement will be construed to make Merchant an agent, employee, franchisee, joint ventures, partner or legal representative of the FINTHESIS. Except as otherwise provided in this Agreement, the Merchant will neither have nor represented itself to have any authority to act on the FINTHESIS's behalf.\n\n16.2. **Notices.** Any notice, approval, or other communication required or permitted under this Agreement will be given in writing and will be sent by email, courier or registered mail, postage prepaid, to the address specified below or to any other address that may be designated by prior notice. Any notice or other communication delivered by email will be deemed to have been received the day it is sent. Any notice or other communication sent by courier will be deemed to have been received on the third day after its date of posting. Any notice or other communication sent by registered airmail will be deemed to have been received on the seventh business day after its date of posting.\n\n**If to FINTHESIS:**\nAddress: 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ.\nEmail: contact@paio.company\n\n**If to Merchant:**\nAddress: Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF\nEmail: general@keyspree.net\n\n16.3. **Assignment.** The Merchant may not assign, delegate, sub-contract, or otherwise transfer this Agreement without the FINTHESIS's prior approval. Any assignment in violation of or in contravention of this provision will be null and void. Notwithstanding the foregoing, the Merchant may assign this Agreement or any of its rights or obligations, upon prior notice to the Merchant to a third party pursuant to a sale, merger, or other consolidation of Distributor.\n\n16.4. **Waiver, Amendment, and Modification.** Any waiver, amendment, or other modification of this Agreement will not be effective unless in writing and signed by the party against whom enforcement is sought. Any waiver or failure to enforce any provision of this Agreement on one occasion will not be deemed a waiver of any other provision or of such provision on any other occasion.\n\n16.5. **Severability.** If any provision of this Agreement is held to be unenforceable, in whole or in part, such holding will not affect the validity of the other provisions of this Agreement. The parties agree to renegotiate in good faith those provisions so held to be invalid to be valid, enforceable provisions which provisions shall reflect as closely as possible the original intent of the parties, and further agree to be bound by the mutually agreed substitute provision.\n\n16.6. **Interpretation.** The terms that are defined in this Agreement may be used in the singular or the plural, as the context requires. \"Days\" means calendar days, unless otherwise specified, eg. business days. \"Person\" means an individual, partnership, Merchant, corporation, or other legal authority, as the context requires. \"Agreement\" means this Agreement and all of its Annexes. Headings are intended only for reference purposes.\n\n16.7. **Entire Agreement.** This Agreement and its Annexes constitute the complete and entire statement of all terms, conditions, and representations of the agreement between FINTHESIS and Merchant with respect to its subject matter and supersedes all prior communications of any nature between the parties.\n\n16.8. **Third party's rights.** This Agreement does not confer any rights on any person or party (other than the parties to this agreement and, where applicable, their successors and permitted assigns) pursuant to the Contracts (Rights of Third Parties) Act 1999.\n\n16.9. **List of Annexes.** The Agreement has the following Annexes:\n- Annex No. 1: Application form for Account opening;\n- Annex No. 2: Tariffs and conditions;\n- Annex No. 3: Act of reconciliation of mutual settlements;\n- Annex No. 4: FINTHESIS Requirements for a Website;\n- Annex No. 5: Fraud Operations.\n\n---\n\n## IN WITNESS WHEREOF\n\nFINTHESIS and Merchant cause this Agreement to be executed by their duly authorized representatives identified below.\n\n---\n\n## 17. LOCATION AND DETAILS OF THE PARTIES\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________\n\n/Yuliia NIKULINA/\n\n*Signed by: 9AC222D95A1B4E7...*\n\n---\n\n### TERRAGAMINEX LIMITED\n\n**Director**\n\n_____________________\n\n/Veronika Trubovica/\n\n*Signed by: 1FF9665969AC4DF...*\n\n---\n\n---\n\n# Annex № 1\n## to the Agreement № 2025/2910-01 dd 29.10.2025\n\n### (i) GENERAL INFORMATION ABOUT THE MERCHANT\n\n| Field | Value |\n|-------|-------|\n| 1. Legal name | TERRAGAMINEX LIMITED |\n| 2. Brand Name | - |\n| 3. Legal address | Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF |\n| 4. Actual (postal) address | Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF |\n| 5. TIN | - |\n| 6. Telephone | +37128009431 |\n| 7. E-mail | general@vaulthex.com |\n\n### (ii) DESCRIPTION OF THE MERCHANT'S WEBSITE\n\n| Field | Value |\n|-------|-------|\n| Name of Website (Brand name) | - |\n| MCC code | 5816 |\n| Site address (URL) | https://vaulthex.com/ |\n\n### (iii) PAYMENT DETAILS OF THE MERCHANT\n\n| Field | Value |\n|-------|-------|\n| Account Holder Name | TERRAGAMINEX LIMITED |\n| IBAN No. | SM63J189990980000EEX1110018 |\n| SWIFT | RMOESMS2XXX |\n| Bank name & Bank Address | THE 3ROOKS MONEY S.P.A |\n\n---\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________/Yuliia NIKULINA/\n\n---\n\n### Merchant\n\n**Director**\n\n_________________/Veronika Trubovica/\n\n---\n\n---\n\n# Annex № 2\n## to the Agreement № 2025/2910-01 dd 29.10.2025\n\n## TARIFFS AND CONDITIONS\n\n### Table No. 1 «Tariffs and conditions»\n\n| PARAMETER | VALUE |\n|-----------|-------|\n| Remuneration of the FINTHESIS for payments processing | 3,8% |\n| Authorisation currencies | EUR, GBP, USD, AUD, NOK |\n| Billing currencies | EUR |\n| # of MID's | By request |\n| Commission for a rejected transaction | N/A |\n| Chargeback Cost | 50 EUR |\n| Refund Cost | 5 EUR |\n| Refund Limit | N/A |\n| Limit on Chargeback | 0,5% on the number of transactions for the reporting period |\n| Rolling Reserve from each transaction | 10% holding for 180 days (max 37500 EUR RR) |\n| Number of payouts | Every day basis |\n| Payment days | Every day basis |\n| Transaction currency | EUR |\n| Payment methods | SEPA |\n| type of cards | MasterCard/Maestro |\n| 3D Secure | Only |\n| Minimum payment | 1 EUR |\n| Limit on one terminal per day | NA |\n| Limit on the number of successful transactions from one card per day | Not more than 5000 EUR per month for one card |\n| Limit on the number of rejected transactions from one card per day | NA |\n| The List of default countries included in the terminals | UK/EU |\n\n(*) All other countries shall be opened optionally on request, with the provision of reliable information by the Merchant, and/or as well as a minimum history of working with the Payment FINTHESIS (without violating the terms of the Agreement) during 2-3 months.\n\n---\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________/Yuliia NIKULINA/\n\n---\n\n### TERRAGAMINEX LIMITED\n\n**Director**\n\n_________________/Veronika Trubovica/\n\n---\n\n---\n\n# Annex No. 3\n## to the Agreement No. 2025/2910-01 dd 29.10.2025\n\n## THE ACT OF RECONCILIATION OF MUTUAL SETTLEMENTS № ___\n\n**Date:** _____/__/20___\n\n**Date of the beginning of the reporting period:** ____\n\n**Date of the end of the reporting period:** _______\n\n**FINTHESIS LTD**, hereafter the «Company» and ______ hereafter the «Merchant» agreed the following report:\n\n| # | Description | Amount |\n|---|-------------|--------|\n| 1 | The outstanding debt of the Company to the Merchant at the beginning of the accounting period | EUR |\n| 2 | The total amount of collected Customer payments | EUR |\n| 3 | The amount of Company Fee due | EUR |\n| 4 | The amount of Rolling Reserve | EUR |\n| 5 | The amount of Customer payments minus Company fee due, Rolling Reserve | EUR |\n| 6 | The quantity of Customer payments made during period | |\n| 7 | The total amount of Supplier Settlement Amount transferred to the Merchant during the reporting period | EUR |\n| 8 | The total amount of Rolling Reserve | EUR |\n| 9 | The amount Chargebacks | EUR |\n| 10 | The quantity Chargebacks | |\n| 11 | The amount Chargebacks FX | EUR |\n| 12 | The amount of Refunds and Fraud | EUR |\n| 13 | The quantity of Refunds and Fraud | |\n| 14 | The amount of Refunds and Fraud FX | EUR |\n| 15 | Representment | EUR |\n| 16 | The quantity of returned Chargebacks | EUR |\n| 17 | The outstanding debt of the Company to the Merchant at the end of the accounting period | EUR |\n\nParties confirm, that Company Fee is correctly calculated and they do not have complains.\n\n**Company_______________________** **Merchant________________________**\n\n---\n\n### Annex No. 3 to the Agreement agreed by the Parties:\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________/Yuliia NIKULINA/\n\n---\n\n### Merchant\n\n**Director/Authorised person:**\n\n_________________/Veronika Trubovica/\n\n---\n\n---\n\n# Annex № 4\n## to the Agreement № 2025/2910-01 dd 29.10.2025\n\n## FINTHESIS Requirements for a Website\n\nThese requirements of the FINTHESIS to the Website (hereinafter referred to as the Requirements) are essential conditions for performing Operations using Cards through the Website.\n\nThe requirements reflect the Rules of the IPS for preliminary analysis, the technology of correct customer service, and subsequent monitoring of the Website.\n\nThe requirements must be fully met by the Merchant. The goods/services provided by the Merchant (hereinafter referred to as Services) must comply with the requirements of the Applicable Law, the rules established by the Acquirer, and the IPS.\n\n### 1. Website Requirements\n\nOn the day of the Website's connection to the Payment Gateway (registration in the System), the Website must meet the following requirements and always post the following information:\n\n1.1. All internal links of the Website must be working and processed.\n\n1.2. The Website should not contain links or banners of sites, as well as links of banner networks that contradict the requirements of the Applicable Law, including suspicious sites (for example, sites for adults, etc.).\n\n1.3. The logos of the ICO and the FINTHESIS should not mislead Customers as to what the business is conducted on behalf of.\n\n1.4. The presence of up-to-date reference information about the Merchant and/or about the Website, which does not ambiguously indicate the type of its activity. A mandatory condition is that the Website of the country, the address of the location of the Merchant, the address for correspondence (the address cannot be on demand), as well as the contact phone numbers of the Merchant, by which the buyer can contact the support service of the Website.\n\n1.5. The presence on the Website of the description of the payment procedures for Services using Cards.\n\n1.6. Availability at the Website of information about the provision of Services provided by the Merchant such as terms, methods, as well as any other information necessary to obtain a clear idea of the receipt of the Service after the Transaction using the Card.\n\n1.7. All pages that are related to the operation of the Website's electronic showcase and / or the requirements of the FINTHESIS must be under a single domain name.\n\n1.8. The Website must also provide the following information:\n- Privacy statement for data received from the Customer;\n- Appeal to Customers to save copies of the documents of the completed transaction for the payment of the Service/Products;\n- Appeal to Customers about methods and means of protecting their data;\n- Product Return/Service Cancellation policy.\n\n### 2. Recommendations of the FINTHESIS for the Merchant\n\n2.1. We recommend full compliance of the legal entity for which the domain name of the point is registered and the legal entity of the Merchant. The legal entity for which the domain name is registered is established by using the corresponding databases on the Internet.\n\n2.2. It is recommended that the Website's domain be a second-level domain.\n\n2.3. It is recommended to have the Website on the electronic storefront describing export restrictions on the delivery of goods (works, services), if any.\n\n### 3. Prohibited activities\n\n3.1. The Website (Merchant) does not have the right to provide Services included in the list of prohibited activities:\n\n3.1.1. Gambling (including payment for casino chips, gambling services, online casinos. Lotto), lotteries, as well as bookmaking services (accepting bets, making bets on money or any material value);\n\n3.1.2. unlicensed or illegal lotteries or gambling services (including without limitation the use of or participation in illegal gambling houses, illegal sports betting, casino games and poker games). Countries where online gambling is illegal include the United States of America, Turkey, China, Malaysia and Israel.\n\n3.1.3. Bearer shares and bonds;\n\n3.1.4. Any item that violates any law, statute, ordinances or regulations;\n\n3.1.5. Pharmaceuticals subject to international phase outs or bans;\n\n3.1.6. Diamond trading without Kimberley Certification;\n\n3.1.7. Indecent and obscene material including child pornography;\n\n3.1.8. Production, trade, storage, or transport of significant volumes of hazardous chemicals, or commercial scale usage of hazardous chemicals;\n\n3.1.9. Prescription drugs, drugs and drug paraphernalia (including narcotics, steroids and certain controlled substances that present a risk);\n\n3.1.10. Nutritional additives;\n\n3.1.11. Weapons, munitions and defense equipment (including without limitation, knives, guns, firearms or ammunition);\n\n3.1.12. Trading of fireworks, explosives and nuclear weapons;\n\n3.1.13. Satellite and cable TV descramblers;\n\n3.1.14. Pornography (including child pornography or related hardcore content or services of any kind);\n\n3.1.15. Adult material and adult advertising;\n\n3.1.16. Escort, massage parlours;\n\n3.1.17. Prepaid phone and credit cards;\n\n3.1.18. Human body parts and pathogens;\n\n3.1.19. Material which incites violence, hatred, racism or is considered obscene;\n\n3.1.20. Government IDs and licenses including replicas and novelty items and any counterfeit products;\n\n3.1.21. Unregistered charity services;\n\n3.1.22. Items which encourage or facilitate illegal activities, prepaid debit cards or other stored value cards that are not associated with a merchant and are not limited to purchases of products or services;\n\n3.1.23. Unauthorised processing or payment aggregation products or services; multi-level marketing, pyramid selling or Ponzi schemes, matrix programmes or other \"get rich quick\" schemes or high yield investment programmes;\n\n3.1.24. Goods or services that infringe the intellectual property rights of natural other persons (trademark, patent, copyright);\n\n3.1.25. Uncoded/miscoded gaming, timeshares or property reservation payments (on and off plan);\n\n3.1.26. Cash collection services:\n\n3.1.27. Trade in wildlife or wildlife products regulated under CITES;\n\n3.1.28. Radioactive materials production or trade;\n\n3.1.29. Commercial logging operations or purchase of logging equipment for use in primary tropical moist forest;\n\n3.1.30. Trade or productions in pesticides/herbicides subject to international phase outs or bans;\n\n3.1.31. Production or trade in ozone depleting substances subject to international phase out;\n\n3.1.32. Production or trade in wood or other forestry products from unmanaged forests;\n\n3.1.33. Sale of tobacco products and alcoholic beverages\n\n3.1.34. Drift net fishing in the marine environment using nets in excess of 2.5km. in length Production or activities involving harmful or exploitative forms of forced labour/harmful child labour;\n\n3.1.35. Energy extraction;\n\n3.1.36. Any services utilised for fraud or money laundering. FINTHESIS LTD will report any suspicious activity to the relevant law enforcement agency. You are prohibited from using Your Payment Account to abuse, exploit or circumvent the usage restrictions imposed by a merchant on the services it provides.\n\n3.1.37. Sale of tobacco products and alcoholic beverages;\n\n---\n\n### Annex No. 4 to the Agreement agreed by the Parties:\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________/Yuliia NIKULINA/\n\n---\n\n### Merchant\n\n**Director/Authorized person:**\n\n_________________/Veronika Trubovica/\n\n---\n\n---\n\n# Annex № 5\n## to the Agreement № 2025/2910-01 dd 29.10.2025\n\n## FRAUD OPERATIONS\n\nThe operation is considered as a fraud if:\n\n- The payment operation is protested by the Issuing Bank through the IPS, the Bank, or the Cardholder as fraudulent;\n\n- For a Transaction protested by the Issuing Bank through the IPS or through the Bank of the cardholder, the Merchant cannot provide documents that, from the point of view of the rules of the IPS or the Bank, confirm the correctness of the Merchant;\n\n- The transaction is declared fraudulent (invalid) by the Issuing Bank and /or the ICO;\n\n- According to the Operation, the commission of illegal actions was established on the part of the Merchant's employees.\n\n---\n\n### Annex No. 5 to the Agreement agreed by the Parties:\n\n### FINTHESIS LTD\n\n**Director**\n\n_____________________/Yuliia NIKULINA/\n\n---\n\n### Merchant\n\n**Director/Authorized person:**\n\n_________________/Veronika Trubovica/\n\n---\n\n---\n\n## Document Information\n\n| Field | Value |\n|-------|-------|\n| Document Type | Gateway Services Agreement |\n| Contract Number | 2025/2910-01 |\n| Contract Date | 29.10.2025 |\n| Provider | FINTHESIS LTD |\n| Provider Registration | 12431685 |\n| Provider FCA Number | 924263 |\n| Provider Address | 2-4 Eastern Road, Imperial Offices, Romford, England, RM1 3PJ |\n| Merchant | TERRAGAMINEX LIMITED |\n| Merchant Registration | 15922361 |\n| Merchant Address | Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF |\n| MCC | 5816 |\n| Website | https://vaulthex.com/ |\n| Settlement Currency | EUR |\n| Merchant IBAN | SM63J189990980000EEX1110018 |\n| Merchant BIC | RMOESMS2XXX |\n| Bank | THE 3ROOKS MONEY S.P.A |\n| Docusign Envelope ID | 2F487180-E467-4BE7-B99B-670F3AB39F94 |\n| Total Pages | 18 |\n\n```",
  "plan": {
    "contract_id": "2025/2910-01",
    "company_name": "TERRAGAMINEX LIMITED",
    "company_address": "Shoreditch Exchange, Senna Building, Gorsuch Place, London, England, E2 8JF",
    "company_registration_number": "15922361",
    "provider_name": "FINTHESIS LTD",
    "provider_registration_number": "12431685",
    "provider_fca_number": "924263",
    "contract_date": "2025-10-29",
    "contract_expiry": null,
    "term": "Indefinite (60 days notice to terminate)",
    "governing_law": "England and Wales",
    "mcc": "5816",
    "urls": [
      "https://vaulthex.com/"
    ],
    "settlement_currency": "EUR",
    "rolling_reserve": {
      "percent": 10.0,
      "hold_days": 180,
      "cap_eur": 37500.0
    },
    "fees": [
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:EUR:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "EUR",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:EUR:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:GBP:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "GBP",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:GBP:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "USD",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:USD:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "USD",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:USD:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "AUD",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:AUD:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "AUD",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:AUD:UK"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "NOK",
        "currency_type": "fiat",
        "region": "EU",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:NOK:EU"
      },
      {
        "operation_type": "incoming",
        "payment_type": "card",
        "apm_type": null,
        "currency": "NOK",
        "currency_type": "fiat",
        "region": "UK",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3.8,
        "payout_percent": null,
        "fixed_fee": 0.0,
        "refund_fee": 5.0,
        "chb_fee": 50.0,
        "exchange_fee_percent": null,
        "source": "Contract 2025/2910-01, Annex 2 Tariffs and Conditions",
        "contract_ref": "2025/2910-01:incoming:card:NOK:UK"
      }
    ],
    "settlement_accounts": {
      "merchant": {
        "account_holder": "TERRAGAMINEX LIMITED",
        "iban": "SM63J189990980000EEX1110018",
        "bic": "RMOESMS2XXX",
        "bank_name": "THE 3ROOKS MONEY S.P.A",
        "bank_address": null
      },
      "provider": []
    },
    "contacts": {
      "merchant": {
        "name": "Veronika Trubovica",
        "email": "general@vaulthex.com",
        "phone": "+37128009431"
      },
      "provider": {
        "name": "Yuliia NIKULINA",
        "email": "contact@paio.company"
      }
    }
  }
}