{
  "contract_id": "1812-24",
  "company_name": "ONLINE GO LTD",
  "filename": "contract_1812-24.pdf",
  "markdown": "```markdown\n---\ncontract_id: 1812-24\ncontract_date: 18.12.2024\ncompany_name: ONLINE GO LTD\n---\n\n# PAYMENT MANAGEMENT SERVICES AGREEMENT NO 1812-24\n\nThis PAYMENT MANAGEMENT SERVICES AGREEMENT NO 1812-24 is entered into as of 18th December 2024 (the \"Effective Date\") by and between:\n\n**ONLINE GO LTD**, a legal entity duly established and acting under the laws of English and Wales, with the registered number 15951198, whose registered office is at: office is at 35 Berkeley Square, London, United Kingdom, W1J 5AE, represented by the Director **Stefan CRISMARI**, acted on the basis of the Article of Association (hereinafter referred to as the \"Merchant\"), and\n\n**SMARTFLOW PAYMENTS LIMITED**, a legal entity duly established and acting under the laws of England and Wales with the registered number 11070048, registered office is at: Office 39.18 Level39 One Canada Square, London, England, E14 5AB, represented by the Director **Anastasiia Pervushyna** acted on the basis of the Article of Association (hereinafter referred to as the \"Company\")\n\nThe Merchant and the Company are hereinafter sometimes referred to individually as the \"Party\" and together collectively as the \"Parties\".\n\nThe Company and the Merchant hereby agree that the following updated terms and conditions, and those set forth in Terms of Business Agreement attached hereto, shall be binding upon the Parties.\n\n## General Details\n\n| Field | Value |\n|-------|-------|\n| **Agreement Number** | 1812-24 |\n| **Effective Date** | 18 December 2024 |\n| **Merchant** | ONLINE GO LTD |\n| **Merchant Registration** | 15951198 |\n| **Merchant Address** | 35 Berkeley Square, London, United Kingdom, W1J 5AE |\n| **Company** | SMARTFLOW PAYMENTS LIMITED |\n| **Company Registration** | 11070048 |\n| **Company Address** | Office 39.18 Level39 One Canada Square, London, England, E14 5AB |\n\n---\n\n## RECITALS\n\nWHEREAS, the Merchant would like to obtain the Company Services to facilitate payments by the Merchant's Consumers which may purchase and utilise various interactive content, virtual goods and/or services of the Merchant; and\n\nWHEREAS, the Company operates the payment processing platform designated to collect payments (Internet Acquiring, with the use of electronic means of payment) from Consumers for various interactive content, virtual goods and/or services (the \"Company Platform\"), and\n\nWHEREAS, the Merchant wishes to mandate and instruct the Company to provide payment collection services (hereinafter - Services) for the payments made by the Customers (as defined below) for the Merchant Services (as defined below), and the Company wishes to render such Services in good faith under the terms set forth herein;\n\nNOW, THEREFORE, in consideration of the promises, conditions, covenants, and warranties herein contained, the Parties agree as follows:\n\n## 1. DEFINITIONS\n\n1.1. \"3-D Secure\" is a protocol for authentication of the Cardholders during Payment Transactions with EMI approved by Visa and MasterCard, which allows to minimise the risk of EMI fraud.\n\n1.2. \"Acquiring\" means the performance of payment transactions, which consists in accepting EMI, resulting in the transfer of funds to the Merchant, using the Virtual Payment Terminal.\n\n1.3. \"Authorisation\" shall mean the procedure for obtaining permission to conduct a transaction using electronic means.\n\n1.4. \"Business Day\" shall mean a day other than a Saturday or Sunday and not being a public holiday, and on which banks are open for business either in the country of incorporation of the Merchant (for the purpose of definition of time for obligations and other performances to be executed by the Merchant) or in the country of incorporation of the Company (for the purpose of definition of time for obligations and any other performances to be executed by the Company).\n\n1.5. \"Chargeback\" shall mean the return of funds to the Customer, forcibly initiated by the Issuing Bank under the instruction of the Customer due to errors or Fraud (as defined below). A refund transaction under a Disputed Transaction initiated by the Issuer on behalf of the EMI Holder or the Payment System, as a result of which the amount previously debited from the Issuer upon execution of a Payment Transaction using the Virtual Payment Terminal is refunded to the Issuer by the Acquirer.\n\n1.6. \"Company Fee\" shall mean the compensation that the Company charges Merchant for the services under this Agreement, as specified in Exhibit A.\n\n1.7. \"Confidential Information\" means information owned or legally possessed by a Party to the Agreement, contained on a material medium, which is marked \"confidential\" or when transferring which the Party transmitting the information to the other Party has explicitly stated the confidentiality of such information, and which has limited access.\n\n1.8. \"Customer\" shall mean the end-user, subscriber, purchaser, or other natural person or entity that may potentially use the Company Platform to pay for the Merchant Services.\n\n1.9. \"Disputed Transaction\" means a transaction for which a claim has been received from the EMI Holder, Issuer or Payment Service Provider regarding disagreement with the fact of debiting, the amount of the Payment Transaction, etc.\n\n1.10. \"Fraud\" shall mean theft and fraud committed using a credit card or any similar payment mechanism as a fraudulent source of funds in a transaction, such as unauthorised use of a card as alleged by the cardholder.\n\n1.11. \"Fraudulent Transaction\" means a Payment Transaction performed using a lost/stolen/forged EMI, its duplicate or using information about its details required for the Payment Transaction and used without the permission of the EMI Holder. A Payment Transaction made using an EMI shall be deemed fraudulent by the decision of the Payment System and/or the Issuer.\n\n1.12. \"Electronic Payment Instrument (EMI)\" - is a payment instrument implemented on any medium (in the form of an issued (issued) plastic or other type of card (on a tangible medium or in the form of a virtual card), which contains in electronic form the data necessary to initiate a payment transaction and/or perform other transactions specified in the agreement with the Issuer. Under this Agreement by electronic means of payment refers to bank cards VISA, MasterCard.\n\n1.13. \"Invalid Transaction\" means a Payment Transaction that is recognised by the Bank as invalid after verification of the circumstances of such Payment Transaction on the basis of the PS Rules, taking into account the explanations and documents provided by the Merchant regarding such Payment Transaction, and has one of the following features:\n\n- the transaction was carried out and/or executed in violation of the terms of the SAR Rules or this Agreement;\n\n- use or attempted use of an EMI in someone else's name is detected (there is information that the legal EMI Holder did not participate in the Payment Transaction);\n\n- a forgery of a document under a Payment Transaction with the use of an EMI is detected;\n\n- the Authorisation Code has not been received or received from another Acquirer prior to the Payment Transaction;\n\n- The EMI Holder disputes the transactions performed using the EMI, and the Merchant is unable to provide documents confirming the successful provision of goods/services to the EMI Holder. Such confirmation may include in case of payment for the Goods provided electronically - registration data of the user of the Merchant's Website(s), IP address of the equipment from which the payment was made, mobile phone number in case of payment for the service from a mobile phone, receipt/account number (account ID) of the Merchant and other data, confirming the provision of the Goods to the EMI Holder, and in case of payment for physical goods and/or services - a copy of the receipt and/or check confirming the provision of the Goods to the EMI Holder and containing the date, time of provision/receipt of the Goods, cost, currency, masked EMI number, name and personal signature of the EMI Holder, etc.\n\n1.14. \"IPS\" means the international payment system Visa or MasterCard.\n\n1.15. \"Issuer\" means a legal entity that is an active participant of IPS/NPS, authorised to issue EMI and has issued (has issued) EMI.\n\n1.16. \"Merchant of Record\" or \"MOR\" means the entity that receives the proceeds from the Customer when an order is settled, and is ultimately responsible for the financial transaction.\n\n1.17. \"Merchant Services\" shall mean any services, content, virtual goods, and/or items offered, made available at, or otherwise enabled by the Merchant at the Merchant Sites (as defined below) to the Customer in exchange for the monetary or other valuable consideration, mobile commerce.\n\n1.18. Rolling Reserve shall mean predetermined percentage of the Customer's total turnover, held in a non-interest-bearing account (whether separate or aggregated) for a specified duration before being released to the Customer. The Rolling Reserve is designed to cover potential losses, expenses, damages, assessments, fees, charges, penalties, sanctions, fines, interest, etc., that may occur during the execution of this Agreement due to violations of this Agreement, other relevant agreements, applicable laws and regulations, Rules of the International Payment Systems, Rules of the APM Systems, or any other applicable guidelines. The Rolling Reserve is detailed and calculated as per the stipulations in the Fee Schedule section. The Parties hereby agree that the Rolling Reserve is a financial collateral (the \"Financial Collateral\") in the meaning of the Applicable Law and applies to the monetary funds, Virtual Currencies and their improvements, civil legal increments and fruits on accounts of the Customer secured for the benefit of the Provider that secure discharge of obligations of the Customer under the Agreement.\n\n1.19. \"EMI Holder\" means an individual who legally uses the EMI to initiate a payment transaction and/or perform other transactions specified in the agreement with the Issuer.\n\n1.20. \"Technology\" shall mean the software application programming interface (API) and proprietary process information provided by the Company pursuant to this Agreement.\n\n1.21. \"Term\" shall mean the period of time as set out in Section 8.1.\n\n1.22. Terms of Business Agreement shall mean the Addendum to the Agreement and shall constitutes the integral part of herein;\n\n1.23. \"Territory\" shall strictly mean the specific countries identified in TERMS OF BUSINESS AGREEMENT.\n\n1.24. \"Trade Secrets\" means information related to the production, technology, management, financial and other activities of the Company, the disclosure of which may harm its interests.\n\n1.25. \"Virtual Payment Terminal\" means software that allows payment and other transactions using the details of the EMI on the Internet.\n\n1.26. In this Agreement, unless the contrary intention appears:\n\n1.25.1. Any references, express or implied, to statutes or statutory provisions shall be construed as references to those statutes or provisions as respectively amended or re-enacted or as their application has been modified by other provisions (whether before or after the date hereof) and shall include any orders, regulations, instruments or other subordinate legislation under the relevant statute or statutory provision.\n\n1.25.2. References to Sections, Clauses, Schedules, Addendum or Annexure and Exhibits are to Sections, Clauses in and to Schedules and Exhibits to this Agreement (unless the context otherwise requires).\n\n1.25.3. Headings are inserted for convenience only and shall not affect the construction of this Agreement.\n\n1.25.4. References to persons shall be deemed to include individuals, companies and other bodies corporate, unincorporated associations, societies, firms and public bodies, governments, states and any other entity (whether or not a separate legal entity).\n\n1.25.5. A reference to any gender is deemed to include a reference to any other gender. The singular is considered to include the plural and vice versa.\n\n## 2. SUBJECT MATTER\n\n2.1. In exchange for the Fees set forth in Addendum \"Terms of Business Agreement\" withheld by the Company for its Services from Transaction Amounts, the Company provides payment processing services to the Merchant. At a minimum, the Company Services shall include:\n\na) enabling Transactions to be routed to the relevant International Payment System through Acquirer;\n\nb) enabling Merchant with access to the Company Platform to obtain real-time information about Transactions as well Fees, Chargebacks, Refunds, disputes, etc.; generation of Settlement Reports for each Settlement period enabling the Parties to do reconciliation of their accounts;\n\nc) providing information and messaging (immediate callbacks) about the status of each Transaction, including authorization status, Chargeback dispute status, etc.;\n\nd) provision of access to Company's Payment Gateway and processing of transactions through it;\n\ne) settlement of Transactions to the Merchant's Current Account;\n\nf) safeguarding of the funds in accordance with current legislation;\n\ng) fraud, anti-money laundering and risk management;\n\nh) technical integration support by the Company;\n\ni) technical maintenance of the Company's Platform in order to ensure continuous provision of Services;\n\nj) any other Services necessary for the Company to successfully perform this Agreement.\n\n2.2. The transfer of funds by the Company to the Merchant under the Payment Transaction shall not be considered as the fact of the Company's recognition of the legitimacy of such Payment Transaction if, as a result of an investigation by law enforcement agencies or Payment Systems, it is established that the Payment Transaction is an Invalid Transaction.\n\n2.3. Addendum \"Terms of Business Agreement\", which details the Fees, is hereby incorporated by reference and forms an integral part of this Agreement. Any amendments or updates to Addendum \"Terms of Business Agreement\" shall be communicated in writing and shall also be considered an integral part of this Agreement.\n\n## 3. CHARGEBACKS\n\n3.1. The Merchant bears responsibility and the costs associated with the Chargebacks. The Merchant must carefully track and manage the Chargebacks and take steps to avoid future Chargebacks.\n\n## 4. RIGHTS AND OBLIGATIONS OF THE MERCHANT\n\n4.1. The Merchant shall:\n\n4.1.1. to comply and guarantee that its product always complies with all the rules of the company, rules of International Payment Systems, technical requirements established by International Payment Systems and the Company, as well as PCI DSS standards, as each can change from time to time;\n\n4.1.2. to comply with all laws and regulations, including those relating to anti-money laundering and anti-terrorism, and to notify the Company and relevant government regulatory authorities of any Transaction or other matter related to Merchants that it considers suspicious;\n\n4.1.3. be solely responsible for the payment of all applicable taxes, duties, and other governmental charges (including any penalties, interest, and other additions thereto) that may be imposed on the Merchant in connection with the services provided under this Agreement. The Merchant shall ensure that all taxes due are paid to the appropriate tax authorities in a timely manner;\n\n4.1.4. to indemnify, defend, and hold harmless the Company from and against any and all liabilities, claims, demands, actions, costs, expenses, damages, and losses (including reasonable legal fees) arising out of or in connection with the Merchant's tax obligations and liabilities;\n\n4.1.5. to inform the Company regarding new service providers. The Company has the right to ask KYC set of documents of the new service provider for further approval;\n\n4.1.6. to keep the Trade Secrets, that became known to the Merchant as a result of fulfilment of the Agreement;\n\n4.1.7. Not to disclose any information about the EMI and its Holder (details, EMI number, information about the Payment Transaction, personal information of the PC Holder) to anyone, except as provided by law, including when it is necessary to complete the Payment Transaction;\n\n4.1.8. to return the funds to the EMI Holder in the case of returning the Goods, exclusively to the account of the EMI Holder, from which the payment for the Goods was previously made. It is forbidden to return funds in cash if payment for the relevant Goods was made in non-cash form using the EMI\n\n4.1.9. to provide information (official documents) necessary for proper verification in the field of prevention and countermeasures against legalisation (laundering) of proceeds of crime, financing of terrorism and financing of proliferation of weapons of mass destruction;\n\n4.1.10. during the term of this Agreement to provide information regarding all URL(s) owned and managed by the Merchant (active and dormant);\n\n4.1.11. do not to sell the following Goods, for which payment is made through the Virtual Payment Terminal:\n\n- sale of photographs, video images, computer images, cartoons, simulations or other means or actions containing, including, but not limited to: child pornography, goods/images promoting bestiality, violence and/or hatred, bodily harm, etc;\n\n- sale of weapons, spare parts, ammunition, cold steel weapons prohibited by law enforcement agencies, military equipment, explosives and means for making explosions, chemical warfare agents and means of protection against them;\n\n- sale of special technical means for covert acquisition and registration of acoustic and visual information, interception of information from technical communication channels, covert control over movement, covert inspection of premises, vehicles and other objects, regulatory and technical documentation for the production and use of such means;\n\n- sale of counterfeit, falsified goods, copies of original products (so-called replicas) made by a third-party manufacturer without the relevant intellectual property rights (as evidenced by licences; licence agreements; agreements on the creation and use of an intellectual property object; agreements on the transfer of exclusive intellectual property rights; etc;\n\n- remote sale of medicinal products without an appropriate licence;\n\n- remote sale of tobacco products without a relevant licence;\n\n- sale of biologically active additives;\n\n- sale of escort services and other sexual services, provision of access to adult content, including, but not limited to, subscriptions to websites and video streaming of adult content;\n\n- sale of narcotic and psychotropic drugs, including so-called designer drugs;\n\n- sale of government documents or identity cards;\n\n- sale of other goods or services, the free sale of which is prohibited or restricted by the laws.\n\n4.1.12. The Merchant shall promptly notify the Company in writing of any changes, alterations, or updates to the Merchant's information, bank details, data, or address, including but not limited to contact details, business address, and bank account information. Such notification must be provided at least 5 business days prior to the effective date of the amendment.\n\n4.1.13. The Merchant is responsible for continuously monitoring and ensuring compliance with the current version of the Payment Card Industry Data Security Standard (PCI-DSS). The Merchant must provide all required and updated PCI-DSS compliance documents to Company, including, but not limited to:\n\nthe current Attestation of Compliance (AoC) of any technical vendor involved in processing, storing, or transmitting cardholder data;\n\nthe applicable Self-Assessment Questionnaire (SAQ-A or SAQ-D), demonstrating the Client's compliance with PCI-DSS requirements;\n\nresults of the audit reports of the technical vendor(s), confirming their adherence to PCI-DSS standards.\n\nThese documents must be provided promptly upon request or in the event of any changes and kept up to date to reflect the latest compliance status.\n\n## 5. RIGHTS AND OBLIGATIONS OF THE COMPANY\n\n5.1. The Company shall:\n\n5.1.1. No Unapproved Marketing Activity. The Company must obtain prior written approval of merchant for any public relations, marketing, and advertising activities that company desires to undertake as long as such involves any references to Merchant and its affiliated entities, employees or consultants, products, brands, names, titles and any other intellectual property and/or other proprietary rights. Strictly no licence, whether assumed, implied or explicit, is hereby granted for the use of any of the above under any circumstances without the prior written approval of Merchant.\n\n5.2. The Company has the right:\n\n5.2.1. To demand from the Merchant full and proper fulfilment of obligations under the terms of this Agreement.\n\n5.2.2. To inspect the Website(s) in order to monitor the Merchant's compliance with the provisions of this Agreement and/or the Mastercard Rules.\n\n5.2.3. To prevent Fraudulent transactions, set limits on Payment transactions using EMI.\n\n5.2.4. Without limitation and prior agreement with the Merchant, notify CoP Members of any illegal or unauthorised activities using EMI to stop or prevent possible Fraudulent Transactions.\n\n5.2.5. Receive the Commission Fee for the services rendered in accordance with the procedure and on the terms and conditions specified in this Agreement.\n\n5.2.6. During the investigation, do not credit the amount of funds to the Merchant's Account for any payment transaction for which PS has disputed a suspicious payment transaction, as well as for a fraudulent payment transaction for a period not exceeding 180 (one hundred and eighty) calendar days. At the same time, within 5 (five) days from the date of such suspension, the Company shall provide the Merchant with written explanations on this matter.\n\n5.2.7. Suspend the provision of services in case of suspicion that the transactions contain signs of a criminal offence without prior notice to the Merchant;\n\n5.2.8. To demand from the Merchant signed monthly report as set forth herein.\n\n## 6. Payment Terms\n\n### 6.1. The Company Fee\n\n6.1.1. The Company Fee shall be calculated at the rates specified in the Terms of Business with regard to each payment method and shall be withheld by the Company from the Transaction Amounts.\n\n6.1.2 All payments to the Merchant under this Terms of Business shall be made in EURO (the \"Currency of the Agreement\"). In the event that Company receives the Transaction amounts in the currencies other than the Currency of the Terms of Business, the Company shall, at Company's cost, convert the said amounts into the Currency of the Terms of Business based upon the selling exchange rate published by the Bank of England on their website https://www.bankofengland.co.uk as of the day when the settlement is due to be made by the Company to the Merchant current account.\n\n6.1.3 The Parties agreed that all bank charges and commissions accrued by the Company's bank and the Merchant`s bank will be paid by the Company.\n\n6.1.4. The Company has the right to deduct the Company's Fee from the amount of the Transaction amounts. If the amount of the Company Fee exceeds the Settlement Amount for any applicable period, then the Company shall carry forward any unpaid balance of the Company Fee to subsequent Settlement Amounts and deduct such Company Fee from subsequent Settlement Amounts until such Company Fee is paid in full.\n\n6.1.5. Payments. The Company shall pay the Settlement Amount to the Merchant as set forth herein. The Company shall electronically disburse the Settlement Amount to the bank account specified by the Merchant on the next Business Day for the previous Business Day during which the Transactions were settled.\n\n6.1.6. Rolling reserve (RR) will be paid upon expiration 180 days after termination of this Agreement if there are no sanctions or fees imposed by MasterCard on the Merchant's activity.\n\n6.1.7. retain the Customer's Transaction Amounts/Balance for up to 180 days if the Customer has deactivated their Online Stores. This provision is applicable in scenarios where the Online Store is closed, suspended, or stops accepting payments or providing services/goods without prior written notice to the Provider. This includes any significant reduction in payment acceptance or service/goods provision. Furthermore, if the Online Store is closed or suspended in part or in full, yet continues to process payments, such actions may be considered a breach of this Agreement.\n\n6.1.8. The Company shall have a right to transfer funds that are generated by the Company for the Merchant in accordance with this Agreement to the bank account of a Third Party, if it's approved by both Parties\n\n6.1.9 The Merchant may request to amend the settlement account and/or add another settlement account. The request must be submitted to the Company in writing.\n\n### 6.2 Reporting\n\n6.2.1. The Company shall generate a monthly report detailing transactions, fees and other relevant financial information pertaining to the Merchant's account;\n\n6.2.2. The Company shall provide the Merchant with monthly reports that shall follow the structure provided by Exhibit A hereof and shall be provided to the Merchant by the 10th day of each calendar month for the preceding month;\n\n6.2.3. The Merchant shall review, sign, and return the Monthly Report provided by the Company within five (5) working days of receipt. The signed Monthly Report shall be returned to the Company as acknowledgment and acceptance of the transactions and fees detailed therein;\n\n6.2.4. The Company will send the report in electronic format (e.g., CSV, Excel, or PDF) to the email address designated by the Merchant; and\n\n6.2.5 Should the Merchant identify any discrepancies or errors in the Monthly Report, the Merchant shall notify the Company in writing within the five (5) working days review period. The Company shall investigate and resolve any identified discrepancies in a timely manner.\n\n## 7. LIMITATION OF LIABILITY\n\n7.1. The Merchant warrants and undertakes:\n\n- to conduct business exclusively through the approved URLs and MCCs, set forth in an Addendum \"Terms of Business Agreement\". These URLs are the only channels through which the Merchant's customers may purchase and utilise various interactive content, virtual goods, and/or services strictly under the approved MCCs;\n\n- to obtain written permission from the Company for all subsequent URLs and MCCs that the Merchant intends to use for operating the Virtual Payment Terminal. Any new URLs and MCCs must be approved in writing by the Company before they can be used for business operations;\n\n- to operate only through the approved currencies, set forth in an Addendum \"Terms of Business Agreement\". Any new currencies must be approved in writing by the Company before they can be used for business operations;\n\n- to operate only in the approved territories, as set forth in an Addendum \"Terms of Business Agreement\". Any new territories must be approved in writing by the Company before they can be used for business operations;\n\n- not providing, licensing and using the Virtual Payment Terminal to other merchants/companies not authorised by the Company;\n\n- to ensure that all transactions are conducted in accordance with the terms and conditions of herein and any additional guidelines provided by the Company.\n\n7.2. The full liability of the Parties as a result of the failure of the other Party to fulfil any of its obligations under this Agreement will be the actual direct damages of the Parties that can be proven in court.\n\n7.3. Neither party shall be liable to the other party for any incidental, indirect or consequential damages such as, but not limited to, compensation or damages for loss of present or prospective profits or revenues, loss of actual or anticipated fees on sales or anticipated sales, or expenditures, investments or commitments made in connection with this agreement or in connection with the performance of obligations hereunder.\n\n## 8. TERM AND TERMINATION\n\n8.1. Term. The term of this Agreement shall commence on the Effective Date and shall continue in effect for a period of one (1) year (the \"Initial Term\"). This Agreement is renewed automatically for the next one (1) year, unless one of the Parties declares to terminate this Agreement.\n\n8.2. Any Party may terminate this Agreement for no cause by sending a written notice thereof at least 30 days before the proposed termination date. The Company can terminate this Agreement immediately if theMerchant violates the Mastercard Rules and this Agreement.\n\n8.3. Effect of Termination. Upon termination by either Party, the Merchant shall be liable for all outstanding obligations to the Company and the Company shall be liable for all outstanding obligations to the Merchant. Each Party shall immediately remove from its displays and cease use of any icons and other trademarks or logos that belong to the other Party. The Company shall promptly inform its other relevant partners that the Agreement between the Company and the Merchant has terminated.\n\n## 9. CONFIDENTIALITY AND NON-USE\n\n9.1. The Confidential Information. Each Party acknowledges that it will have access to proprietary or the Confidential Information (the \"Confidential Information\") of the other Party, including, but not limited to, the terms of this Agreement. The Confidential Information entitled to protection under this Agreement shall include, without limitation, technical data, trade secrets, any plans with regard to the products or the Services of the either Party, the Customer or the Supplier lists including without limitation databases, marketing plans, software, source codes for various software, processes, technology, inventions, and designs, either party's financial information including, without limitation, its books and records, either party's marketing information, either party's or a third party's confidential product information, whether or not any such information is marked as confidential, and, in addition, any other information identified as confidential by appropriate markings on any documents exchanged or, if disclosed orally, on a subsequent written notice provided within ten (10) calendar days since disclosure.\n\n9.2. Protection of Confidential Information. Each party will protect the Confidential Information of the other Party in the same manner in which it protects its own Confidential Information (but in any event will use no less than reasonable care), except as may be specifically permitted hereunder. The Confidential Information shall be used for the purposes related to this Agreement only. The Confidential Information shall only be disclosed to the employees of the Parties who need access to it for successful performance of this Agreement.\n\n9.3. Exceptions. The obligations of confidentiality and non-use specified above will not apply to any information of one Party which:\n\n9.3.1 was known by the other Party prior to the date of this Agreement and not obtained or derived, directly or indirectly, from disclosing Party or its affiliates, or if so obtained or derived, was lawfully obtained or derived and is not held subject to any confidentiality or non-use obligations;\n\n9.3.2. is or becomes public or available to the general public otherwise than through any act or default of the receiving Party in violation of the provisions of this Agreement;\n\n9.3.3. is obtained or derived prior or subsequent to the date of this Agreement from a third Party which is lawfully in possession of such information and does not hold such information subject to any confidentiality or non-use obligations;\n\n9.3.4. is independently developed by a Party without use of the disclosing Party's Confidential Information;\n\n9.3.5. is required to be disclosed by one of the Parties pursuant to applicable law or under a government or court order, provided, however, that the obligations of confidentiality and non-use will continue to the fullest extent, not in conflict with such law or order; and, if and when a Party is required to disclose such Confidential Information pursuant to any such law or order, such party will, to the extent legally permissible, give notice to the other party to allow such party to make efforts to obtain a protective order or take such other actions as will prevent or limit public access to, or disclosure of, such Confidential Information.\n\n9.4. Access to Confidential Information. Access to all Confidential Information shall be restricted to those employees of the receiving Party's immediate organisation, parent corporations, subsidiaries, and other persons, such as consultants, attorneys, and other advisors having a need to know to perform services specifically requested by one Party or the other to fulfil the purpose of this Agreement. The receiving Party shall notify such employees or persons of the proprietary nature of the Confidential Information and shall require such employees or other persons to agree in the form of a non-disclosure agreement enforceable in the respective jurisdiction to maintain the confidentiality of the Confidential Information on the same terms as set forth herein. Except as expressly permitted by this Agreement, the Confidential Information shall not be disclosed to any third Party without the prior written consent of the disclosing Party\n\n9.5. These Confidential Information provisions shall be valid for the duration of the Agreement and for 1 (one) year afterwards.\n\n## 10. GOVERNING LAW. DISPUTE RESOLUTION.\n\n10.1. The Agreement shall be governed by the law England and Wales\n\n10.2. The Parties will attempt to settle all disputes and disagreements arising from this Agreement and related to the execution, validity and termination of this Agreement through negotiations within 30 (thirty) Business Days. If the Parties are unable to resolve the dispute, dispute shall be exclusively and finally resolved by binding confidential arbitration administered by the London Courts of the International Arbitration (\"LCIA\") under LCIA Rules, with one arbitrator to be appointed by mutual agreement of the Parties. The seat of arbitration shall be London, and the language of arbitration shall be English. All costs of arbitration, including court costs, will be borne by the unsuccessful party. The Parties agree to carry out any arbitral award without delay. The arbitration award may be enforced by any court of competent jurisdiction.\n\n## 11. AMENDMENTS AND MODIFICATION.\n\n11.1. No variation of this Agreement shall be effective unless it is in writing and signed by or on behalf of each party. Notwithstanding this, the parties agree that any future changes, alterations, or updates to the terms of this Agreement, including but not limited to changes in information, bank details, data, address, fees, commissions, MCC codes or services, shall be governed by a single standard additional agreement named \"Addendum \"Terms of Business Agreement\" set forth herein. This Terms of Business agreement, once executed, shall be deemed incorporated by reference and shall form an integral part of this Agreement.\n\n11.2. Either party may propose changes covered by Terms of Business Agreement by submitting a written request to the other party.\n\n11.3. Proposed changes shall be documented using the Terms of Business Agreement.\n\n11.4. Both parties must approve and sign the Terms of Business for the changes to be effective.\n\n11.5. The changes outlined in the Terms of Business Agreement shall take effect on the date specified there, provided that the form has been duly executed by both parties.\n\n11.6. This Agreement shall be reviewed and updated on an annual basis, or as necessary, to ensure it remains current and accurate. Each updated version of the Terms of Business Agreement shall supersede the previous version and be deemed an integral part of the herein.\n\n11.7. By incorporating this clause, the Parties ensure that all future amendments are managed through a single, regularly updated document, thereby simplifying the process and maintaining clarity in the Agreement.\n\n## 12. GENERAL PROVISIONS.\n\n12.1. Force Majeure. No Party shall be deemed in default of this Agreement to the extent that performance of its respective obligations or attempts to cure any breach are delayed or prevented by reason of any Act of God, fire, natural disaster, accident, act of government, or any other cause beyond the reasonable control of such Party; provided, that the Party influenced by such force majeure circumstances shall, within the period of seven (7) calendar days, notify the other Party by cable or fax message of emergence, type and expected duration of force majeure circumstances preventing the notifying Party from performance of its obligations under this Agreement. The existence of such force majeure circumstances must be confirmed by a Chamber of Commerce or other authorised independent body within 3 weeks since the date of force majeure event. If such notification is not sent in accordance with the above provision, the Party influenced by force majeure circumstances shall not have the right to refer to such force majeure circumstances as the reason for its non-performance of obligations under this Agreement. During the existence of force majeure circumstances releasing the Parties from their obligations hereunder, the Parties suspend the performance of their obligations without any sanctions. In the event of such force majeure circumstances existing for the period of over three (3) months, the Parties shall negotiate further performance of this Agreement. If the Parties do not come to an agreement in this respect, each of the Parties has the right to terminate this Agreement immediately and unilaterally by sending the other Party a notice of termination.\n\n12.2. No Partnership. Nothing contained in this Agreement shall be construed as creating any partnership, employer-employee relationship or joint venture between the Parties. Neither Party shall be authorised to act as an agent for the other, nor shall either Party enter into any agreement or contract on behalf of the other as representative or agent.\n\n12.3. Entire Agreement. This Agreement, combined with the Addendum, Schedules, Exhibits, Annexes and Appendices attached hereto, constitutes the entire agreement between the Parties with respect to the subject matter hereof and supersedes all prior negotiations, understandings, and agreements, whether oral or written between the Parties hereto concerning the subject matter hereof.\n\n12.4. No Reliance. Each party acknowledges that, in entering into this Agreement, it does not rely on, and shall have no remedy in respect of, any statement, representation, warranty, or understanding (whether negligently or innocently made) of any person (whether a party to this Agreement or not) other than as expressly set out in this Agreement.\n\n12.5. Precedence. In the event of any conflict or inconsistency between the terms of this Agreement and any other document referred to herein, the terms of this Agreement shall prevail.\n\n12.6. Severability. Should any provision of this Agreement be determined to be unenforceable or prohibited by any applicable law, such provision shall be ineffective to the extent, and only to the extent, of such unenforceability or prohibition without invalidating the balance of such provision or any other provision of this Agreement. The Parties agree and undertake to amend this Agreement as necessary and in such a manner as to legally permit them to fulfil their obligations hereunder.\n\n12.7. Headings. Section headings are inserted for convenience and shall not define, limit, construe nor describe the scope or extent of such section.\n\n12.8. Written Modification. No modification, addendum, amendment, clarification of this Agreement or of any provision hereof shall be effective unless in writing and signed by both Parties. Scanned copies of this Agreements and any documents thereto shall be legally binding if signed by authorised representatives of the Parties.\n\n12.9. This Agreement is made in two (2) copies, both in English, one copy for each of the Parties.\n\nIN WITNESS WHEREOF, the undersigned hereby acknowledge that they have read and understand the terms of this Agreement, and that by signing this Agreement they agree to be bound by all terms, conditions, and obligations contained herein.\n\n## 13. SIGNATURES AND DETAILS OF THE PARTIES.\n\n**\"MERCHANT\"**\n\nBy: **ONLINE GO LTD**\n\nName: Stefan CRISMARI\nTitle: Director\n\nSignature:_____________\n\n**\"COMPANY\"**\n\nBy: **SMARTFLOW PAYMENTS LIMITED**\n\nName: Anastasiia Pervushyna\nTitle: Director\n\nSignature:_____________\n\n---\n\n## EXHIBIT A\n\n### Form of Monthly Report\n\nThe act of reconciliation of mutual settlements № [number]\n\nStart of the current Reporting Period: [date]\n\nEnd of the current Reporting Period: [date]\n\nSMARTFLOW PAYMENTS LIMITED, hereafter the «Company» and ONLINE GO LTD hereafter the «Merchant» agreed the following report:\n\n| | Description | Amount | Currency |\n|---|-------------|--------|----------|\n| 1 | The outstanding debt of the Company to the Merchant at the beginning of the accounting period | | EUR |\n| 2 | The total amount of collected customer payments | | EUR |\n| 3 | The amount of the Company Fee due | | EUR |\n| 4 | The amount of Rolling Reserve acquired during this period | | EUR |\n| 5 | The total amount of Rolling Reserve | | EUR |\n| 6 | The amount of customer transactions minus Company Fee due, Rolling Reserve | | EUR |\n| 7 | The quantity of customer transactions made throughout the period | | |\n| 8 | The total Supplier Settlement Amount transferred to the Merchant within the reporting period | | EUR |\n| 9 | The amount of Chargebacks | | EUR |\n| 10 | The quantity of Chargebacks | | |\n| 11 | The amount of Refunds and Fraud | | EUR |\n| 12 | The quantity of Refunds and Fraud | | |\n| 13 | Representment amount | | EUR |\n| 14 | The amount of returned Chargebacks | | EUR |\n| 15 | The outstanding debt of the Company to the Merchant at the end of the accounting period | | EUR |\n\nParties confirm that the above mentioned Amounts are correct and they do not have complaints to each other.\n\nCompany:                                          Merchant:\n\n---\n\n## Terms of Business Agreement\n\n### Addendum to the Payment Management Services Agreement NO 1812-24\n\n**Date: 18 December 2024**\n\n**ONLINE GO LTD**, a legal entity duly established and acting under the laws of English and Wales, with the registered number 15951198, whose registered office is at: office is at 35 Berkeley Square, London, United Kingdom, W1J 5AE, represented by the Director **Stefan CRISMARI**, acted on the basis of the Article of Association (hereinafter referred to as the \"Merchant\"), and\n\n**SMARTFLOW PAYMENTS LIMITED**, a legal entity duly established and acting under the laws of England and Wales with the registered number 11070048, registered office is at: Office 39.18 Level39 One Canada Square, London, England, E14 5AB, represented by the Director **Anastasiia Pervushyna** acted on the basis of the Article of Association (hereinafter referred to as the \"Company\")\n\nThe Company and the Merchant hereby agree that the following updated terms and conditions, and those set forth in Terms of Business Agreement attached hereto, shall be binding upon the Parties.\n\n### COMPANY FEE. COMPANY PAYMENT OPTIONS\n\n| No. | Online services | Company Fee, % |\n|-----|-----------------|----------------|\n| 1. | Internet acquiring, EUR<br>Apple Pay and Google Pay | 3 % |\n| 2. | Chargeback | 50 EUR |\n| 3. | Refund | 5 EUR |\n| 4. | RR | 10% of a transaction, to be returned (with the following settlement) within 180 days thereafter (maximum aggregated amount of the RR at the time – 50 000 EUR) |\n\n### APPROVED TERMS\n\n| No. | Terms | |\n|-----|-------|---|\n| 1. | URLS | https://legacy-on.com/ |\n| 2. | MCC | 5816 |\n| 3. | Currencies | EURO |\n| 4. | Territories | EU, GB |\n\n### SETTLEMENT ACCOUNTS\n\n| No. | Company Name | Bank Details |\n|-----|--------------|--------------|\n| 1. | **ONLINE GO LTD** | Account Holder Name: PAYBIS POLAND<br>BIC/SWIFT: BFRILI22<br>IBAN (EUR): LI13 0881 1010 5371 K000 E<br>Bank: Bank Frick<br>Bank Address: Landstrasse 14, 9496, Balzers, Liechtenstein |\n| 2. | **SMARTFLOW PAYMENTS LIMITED** | Account Holder Name: SMARTFLOW PAYMENTS LIMITED<br>IBAN: CH6308843243421127010<br>Bank Name: Dukascopy Bank SA<br>Bank Address: Route de Pré-Bois 20, Genève 1215, Switzerland (CH)<br>BIC: DUBACHGGXXX |\n\n### CONTACT DETAILS\n\n| ONLINE GO LTD | SMARTFLOW PAYMENTS LIMITED |\n|---------------|----------------------------|\n| NAME: **Stefan CRISMARI**<br>EMAIL: finance@legacy-on.com | NAME: **Anastasiia Pervushyna**<br>EMAIL: apa@sends.co |\n\n### SIGNATURES AND DETAILS OF THE PARTIES\n\n**\"MERCHANT\"**\n\nBy: **ONLINE GO LTD**\n\nName: Stefan CRISMARI\nTitle: Director\n\nSignature:_____________\n\n**\"COMPANY\"**\n\nBy: **SMARTFLOW PAYMENTS LIMITED**\n\nName: Anastasiia Pervushyna\nTitle: Director\n\nSignature:_____________\n```",
  "plan": {
    "contract_id": "1812-24",
    "company_name": "ONLINE GO LTD",
    "contract_date": "18.12.2024",
    "contract_expiry": null,
    "exchange_rates": {
      "fiat_percent": null,
      "crypto_percent": null
    },
    "rolling_reserve": {
      "percent": 10,
      "hold_days": 180,
      "cap_eur": 50000
    },
    "declined_fee": {
      "percent": null,
      "fixed_fee": null
    },
    "fees": [
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Internet acquiring, EUR | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "EU",
        "payment_type": "card",
        "apm_type": null
      },
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Internet acquiring, EUR | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "GB",
        "payment_type": "card",
        "apm_type": null
      },
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Apple Pay and Google Pay | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "EU",
        "payment_type": "apm",
        "apm_type": "apple_pay"
      },
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Apple Pay and Google Pay | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "EU",
        "payment_type": "apm",
        "apm_type": "google_pay"
      },
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Apple Pay and Google Pay | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "GB",
        "payment_type": "apm",
        "apm_type": "apple_pay"
      },
      {
        "operation_type": "incoming",
        "card_brands": null,
        "currency_type": "fiat",
        "volume_min": null,
        "volume_max": null,
        "wl_percent": 3,
        "ftd_percent": null,
        "payout_percent": null,
        "fixed_fee": 0,
        "payout_min": null,
        "refund_fee": 5,
        "chb_fee": 50,
        "exchange_fee_percent": null,
        "source": "Apple Pay and Google Pay | 3% | Chargeback 50 EUR | Refund 5 EUR",
        "currency": "EUR",
        "region": "GB",
        "payment_type": "apm",
        "apm_type": "google_pay"
      }
    ]
  }
}